exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/target_kernel_impl.c
/*
 *  TOPPERS/ASP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Advanced Standard Profile Kernel
 *
 *  Copyright (C) 2026 by Embedded and Real-Time Systems Laboratory
 *              Graduate School of Information Science, Nagoya Univ., JAPAN
 *
 *  上記著作権者は，本ソフトウェアをTOPPERSライセンス（条件は他のソー
 *  スファイルの先頭コメントを参照）の下で利用することを許諾する．本ソ
 *  フトウェアは無保証で提供される．
 */

/*
 *  ターゲット依存モジュール（ESP32-C5用）
 *
 *  esp32c6版（asp3_core/target/esp32c6_espidf/target_kernel_impl.c
 *  相当）からのコピー・C5対応。C6ブリングアップ専用のGPIO/UART/
 *  RTC-RAM診断計装（docs/c5-port-design.md §8.3「C6資産の非移植方針」）
 *  は持ち込まず，WDT無効化・基本初期化のみのクリーンな実装とした。
 *  ROMブートローダ通過後の状態を継承し（UART0は115200bpsで設定済み，
 *  SYSTIMERはリセット後デフォルトでクロック供給済み），追加で必要な
 *  処理はリセット後デフォルトで有効なウォッチドッグタイマの無効化の
 *  みである（無効化しないと数秒でリブートする．C3/C6と同様）。
 */
#include "kernel_impl.h"
#include "target_syssvc.h"
#include <sil.h>
#ifdef TOPPERS_OMIT_TECS
#include "chip_serial.h"
#endif
#ifdef TOPPERS_ESP32C5_WIFI
#include "esp_rom_sys.h"	/* esp_rom_set_cpu_ticks_per_us宣言．
							   Wi-Fi有効時のみROM ld（esp32c5.rom.api.ld）
							   がシンボル実体を提供するため呼出しもガードする
							   （下記hardware_init_hook参照） */
#endif

/*
 *  【実施41】呼出し側マクロ（ESP32C5_R41_CALL_BOOTHOOK／
 *  ESP32C5_R41_CALL_ESPWIFIINIT）はいずれもESP32C5_R41_COMBINED19が
 *  提供する関数・データを使うため，呼出し側マクロだけがビルドへ渡され
 *  定義側マクロが未定義という取り違えを防ぐために自動的に含意する。
 */
#if defined(ESP32C5_R41_CALL_BOOTHOOK) || defined(ESP32C5_R41_CALL_ESPWIFIINIT)
#ifndef ESP32C5_R41_COMBINED19
#define ESP32C5_R41_COMBINED19 1
#endif
#endif

#ifdef TOPPERS_ESP32C5_WIFI
/*
 *  【実施31】較正キー(A)候補の加算移植：stockの2nd-stageブートローダが
 *  bootloader_init()の中で無条件に実行する bootloader_random_enable()/
 *  bootloader_random_disable()（SAR ADCをエントロピー源として駆動する
 *  reset→enable→sampling→disableサイクル．ESP-IDF v6.1
 *  components/bootloader_support/src/bootloader_random_esp32c5.c）を，
 *  レジスタ順序・自己クリア型パルスを保持したまま生MMIO直叩きで移植した
 *  もの。ASP3のDirect Bootは2nd-stageブートローダを一切経由しないため，
 *  このサイクルが実機で一度も実行されていない。
 *
 *  実施31のJTAG実測で新規発見：PCR_SARADC_CLKM_CONF_REG(0x6009608c)の
 *  CLKM_EN(bit22)が，ASP3較正ハング状態で2/2ブート共に0x00004000
 *  （CLKM_EN=0）である一方，stock（実施29 r29_snapshot，2/2）は
 *  0x00404000（CLKM_EN=1）——bootloader_random_enable()の
 *  adc_ll_enable_func_clock(true)が立て，disable()側では一度も
 *  クリアされない（BOOTLOADER_BUILD分岐はregi2c_saradc_disable()を
 *  呼ばずADCの regi2c 電源自体は解除しない設計）ため恒久的に残る，
 *  という新規・再現性ありの静的差分。実施14-25/実施20の網羅比較
 *  （PCR_SARADC_CONF等）はこのCLKM_CONFレジスタを対象に含んでいな
 *  かった（見落とし）。
 *
 *  【移植範囲の意図的な限定】bootloader_random_enable/disable本体は
 *  adc_ll_regi2c_init()/adc_ll_set_calibration_param()等，regi2c
 *  （I2C_SAR_ADCブロック，host 0x69）経由のバイアス・較正コード設定も
 *  含むが，regi2cアドレス空間は実施16で8ブロック×reg 0x00-0x1F全域を
 *  ASP3/stock間で比較済み・新規差分ゼロと確定している。したがって
 *  regi2c媒介部分は「既に最終値が一致することが分かっている」ため本
 *  移植では意図的に対象外とし，PCR/PMU/APB_SARADC/LPPERIの純粋MMIO
 *  操作（レジスタ順序・自己クリア型パルスは保持）のみを移植した。
 *  bootloader_hardware_init()のregi2cマスタクロック有効化
 *  （MODEM_LPCON.clk_conf.clk_i2c_mst_en）は既に本ファイルの
 *  phy_enable_wrapper（esp_wifi_adapter.c）が0x600af018=0x7で等価に
 *  設定済み（実施09時点で実機確認済み）のため，configure_clock()の
 *  clk_i2c_mst_sel_160mビットのみ追加移植する。
 *  bootloader_ana_reset_config()（BOD/glitch reset設定）と
 *  regi2c媒介部分は，本ラウンドの結果次第で次段の候補として残す
 *  （docs/c5-bringup.md実施31）。
 */
#define ESP32C5_R31_PCR_SARADC_CONF        0x60096088U
#define ESP32C5_R31_PCR_SARADC_CLKM_CONF   0x6009608CU
#define ESP32C5_R31_PCR_TSENS_CLK_CONF     0x60096090U
#define ESP32C5_R31_MODEM_SYSCON_CLK_CONF  0x600A9C04U
#define ESP32C5_R31_PMU_RF_PWC             0x600B0158U
#define ESP32C5_R31_LPPERI_RNG_CFG         0x600B2824U
#define ESP32C5_R31_APB_SARADC_CTRL        0x6000E000U
#define ESP32C5_R31_APB_SARADC_CTRL2       0x6000E004U
#define ESP32C5_R31_APB_SARADC_PATT_TAB1   0x6000E018U
#define ESP32C5_R31_APB_SARADC_PATT_TAB2   0x6000E01CU

static void
esp32c5_r31_set_patt_table(uint32_t pattern_index, uint32_t unit,
							uint32_t channel, uint32_t atten)
{
	/*  adc_ll_digi_set_pattern_table()（hal/esp32c5/include/hal/adc_ll.h）
	 *  のビット詰め計算をそのまま転写。  */
	uint32_t	addr;
	uint32_t	off = (pattern_index % 4U) * 6U;
	uint32_t	val = (atten & 0x3U) | ((channel & 0x7U) << 2)
					  | ((unit & 0x1U) << 5);
	uint32_t	tab;

	addr = ((pattern_index / 4U) == 0U) ? ESP32C5_R31_APB_SARADC_PATT_TAB1
										 : ESP32C5_R31_APB_SARADC_PATT_TAB2;
	tab = sil_rew_mem((void *)addr);
	tab &= ~(0xFC0000U >> off);
	tab |= ((val & 0x3FU) << 18) >> off;
	sil_wrw_mem((void *)addr, tab);
}

static void
esp32c5_r31_bootloader_random_cycle(void)
{
	uint32_t	v;

	/*  bootloader_hardware_init()の一部：regi2cマスタクロックのソース
	 *  選択（160MHz）。clk_i2c_mst_enはphy_enable_wrapperが既に等価に
	 *  設定するため対象外（上記コメント参照）。  */
	v = sil_rew_mem((void *)ESP32C5_R31_MODEM_SYSCON_CLK_CONF);
	sil_wrw_mem((void *)ESP32C5_R31_MODEM_SYSCON_CLK_CONF, v | (1U << 12));

	/*  bootloader_random_enable()（BOOTLOADER_BUILD分岐）  */

	/*  adc_ll_reset_register()：自己クリア型パルス×2  */
	v = sil_rew_mem((void *)ESP32C5_R31_PCR_SARADC_CONF);
	sil_wrw_mem((void *)ESP32C5_R31_PCR_SARADC_CONF, v | (1U << 1));	/* RST_EN=1 */
	v = sil_rew_mem((void *)ESP32C5_R31_PCR_SARADC_CONF);
	sil_wrw_mem((void *)ESP32C5_R31_PCR_SARADC_CONF, v & ~(1U << 1));	/* RST_EN=0 */
	v = sil_rew_mem((void *)ESP32C5_R31_PCR_SARADC_CONF);
	sil_wrw_mem((void *)ESP32C5_R31_PCR_SARADC_CONF, v | (1U << 3));	/* REG_RST_EN=1 */
	v = sil_rew_mem((void *)ESP32C5_R31_PCR_SARADC_CONF);
	sil_wrw_mem((void *)ESP32C5_R31_PCR_SARADC_CONF, v & ~(1U << 3));	/* REG_RST_EN=0 */

	/*  temperature_sensor_ll_reset_module()：同じPCRリセットドメイン内の
	 *  自己クリア型パルス（tsensレジスタのbackup/restoreはASP3が
	 *  tsensを未使用のため省略——docs/c5-bringup.md実施31に明記）  */
	v = sil_rew_mem((void *)ESP32C5_R31_PCR_TSENS_CLK_CONF);
	sil_wrw_mem((void *)ESP32C5_R31_PCR_TSENS_CLK_CONF, v | (1U << 23));
	v = sil_rew_mem((void *)ESP32C5_R31_PCR_TSENS_CLK_CONF);
	sil_wrw_mem((void *)ESP32C5_R31_PCR_TSENS_CLK_CONF, v & ~(1U << 23));

	/*  adc_ll_enable_bus_clock(true) / adc_ll_enable_func_clock(true)  */
	v = sil_rew_mem((void *)ESP32C5_R31_PCR_SARADC_CONF);
	sil_wrw_mem((void *)ESP32C5_R31_PCR_SARADC_CONF, v | (1U << 2));	/* REG_CLK_EN=1 */
	v = sil_rew_mem((void *)ESP32C5_R31_PCR_SARADC_CLKM_CONF);
	sil_wrw_mem((void *)ESP32C5_R31_PCR_SARADC_CLKM_CONF, v | (1U << 22));	/* CLKM_EN=1 */

