exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/target_kernel_impl.c
	/*  adc_ll_digi_clk_sel(ADC_DIGI_CLK_SRC_XTAL) → CLKM_SEL[21:20]=0 ；
	 *  adc_ll_digi_controller_clk_div(0,0,0) → DIV_NUM[19:12]/DIV_B[11:6]/
	 *  DIV_A[5:0]を全て0に  */
	v = sil_rew_mem((void *)ESP32C5_R31_PCR_SARADC_CLKM_CONF);
	v &= ~((0x3U << 20) | (0xFFU << 12) | (0x3FU << 6) | 0x3FU);
	sil_wrw_mem((void *)ESP32C5_R31_PCR_SARADC_CLKM_CONF, v);
	/*  APB_SARADC側のADC_CTRL_CLK（digital domain clock）も立てる  */
	v = sil_rew_mem((void *)ESP32C5_R31_APB_SARADC_CTRL);
	sil_wrw_mem((void *)ESP32C5_R31_APB_SARADC_CTRL, v | (1U << 6));

	/*  regi2c_ctrl_ll_i2c_sar_periph_enable()：PMU_RF_PWC_REGの
	 *  reset→enable→work切替パルス  */
	v = sil_rew_mem((void *)ESP32C5_R31_PMU_RF_PWC);
	sil_wrw_mem((void *)ESP32C5_R31_PMU_RF_PWC, v & ~(1U << 26));		/* PERIF_I2C_RSTB=0 */
	v = sil_rew_mem((void *)ESP32C5_R31_PMU_RF_PWC);
	sil_wrw_mem((void *)ESP32C5_R31_PMU_RF_PWC, v | (1U << 27));		/* XPD_PERIF_I2C=1 */
	v = sil_rew_mem((void *)ESP32C5_R31_PMU_RF_PWC);
	sil_wrw_mem((void *)ESP32C5_R31_PMU_RF_PWC, v | (1U << 26));		/* PERIF_I2C_RSTB=1 */

	/*  [regi2c媒介のadc_ll_regi2c_init()/adc_ll_set_calibration_param()
	 *  は上記コメントの理由により意図的に対象外]  */

	/*  パターンテーブル設定：ADC_UNIT_1 ch7 atten12dB（index0），
	 *  ADC_UNIT_2 ch1 atten12dB（index1）  */
	esp32c5_r31_set_patt_table(0U, 0U, 7U, 3U);
	esp32c5_r31_set_patt_table(1U, 1U, 1U, 3U);
	v = sil_rew_mem((void *)ESP32C5_R31_APB_SARADC_CTRL);
	v &= ~(0x7U << 15);
	v |= (1U << 15);					/* patt_len=2 → (2-1)=1 */
	v &= ~(0xFFU << 7);
	v |= (15U << 7);					/* digi_set_clk_div(15) */
	sil_wrw_mem((void *)ESP32C5_R31_APB_SARADC_CTRL, v);

	v = sil_rew_mem((void *)ESP32C5_R31_APB_SARADC_CTRL2);
	v &= ~(0xFFFU << 12);
	v |= (200U << 12);					/* trigger_interval(200) */
	sil_wrw_mem((void *)ESP32C5_R31_APB_SARADC_CTRL2, v);
	v = sil_rew_mem((void *)ESP32C5_R31_APB_SARADC_CTRL2);
	sil_wrw_mem((void *)ESP32C5_R31_APB_SARADC_CTRL2, v | (1U << 24));	/* timer_en=1 */

	/*  rng_ll_enable_sample/rtc_timer/rng_timer  */
	v = sil_rew_mem((void *)ESP32C5_R31_LPPERI_RNG_CFG);
	v |= (1U << 0);						/* SAMPLE_ENABLE */
	v |= (0x3U << 10);					/* RTC_TIMER_EN=3 */
	v |= (1U << 9);						/* RNG_TIMER_EN */
	sil_wrw_mem((void *)ESP32C5_R31_LPPERI_RNG_CFG, v);

	/*  stockはこの区間でflash読出し／復号等のRNG消費処理を挟んでから
	 *  disable()を呼ぶ。ASP3のDirect BootにはPHY較正上有意な代替処理
	 *  が無いため，実際にADC変換が複数回走るのに十分な時間として
	 *  5ms相当のbusy waitで近似する（実施31の意図的な簡略化点）。  */
	esp_rom_delay_us(5000U);

	/*  bootloader_random_disable()（BOOTLOADER_BUILD分岐：
	 *  regi2c_saradc_disable()は呼ばれないため，PMU_RF_PWC/regi2c電源は
	 *  解除せずそのまま——stockの実機観測（CLKM_EN=1が恒久的に残る）と
	 *  一致させる）  */
	v = sil_rew_mem((void *)ESP32C5_R31_APB_SARADC_CTRL2);
	sil_wrw_mem((void *)ESP32C5_R31_APB_SARADC_CTRL2, v & ~(1U << 24));	/* trigger_disable */
	sil_wrw_mem((void *)ESP32C5_R31_APB_SARADC_PATT_TAB1, 0xFFFFFFU);
	sil_wrw_mem((void *)ESP32C5_R31_APB_SARADC_PATT_TAB2, 0xFFFFFFU);

	/*  [regi2c媒介のadc_ll_regi2c_adc_deinit()は対象外]  */

	/*  ANALOG_CLOCK_DISABLE()はBOOTLOADER_BUILDではno-op（regi2c_ctrl.h
	 *  参照）——何もしない  */

	/*  adc_ll_digi_controller_clk_div(4,0,0) + adc_ll_digi_clk_sel(XTAL)  */
	v = sil_rew_mem((void *)ESP32C5_R31_PCR_SARADC_CLKM_CONF);
	v &= ~((0x3U << 20) | (0xFFU << 12) | (0x3FU << 6) | 0x3FU);
	v |= (4U << 12);
	sil_wrw_mem((void *)ESP32C5_R31_PCR_SARADC_CLKM_CONF, v);
}
#endif /* TOPPERS_ESP32C5_WIFI */

/*
 *  エラー時の処理
 */
extern void Error_Handler(void);

/*
 *  終了時のフック（weak定義を本ファイル末尾に置く）
 */
extern void software_term_hook(void);

/*
 *  MWDT（タイマグループのウォッチドッグ）の無効化
 */
static void
esp32c5_disable_mwdt(uint32_t timg_base)
{
	sil_wrw_mem((void *)ESP32C5_TIMG_WDTWPROTECT(timg_base),
				ESP32C5_TIMG_WDT_WKEY);         /* 書込み保護の解除 */
	sil_wrw_mem((void *)ESP32C5_TIMG_WDTCONFIG0(timg_base), 0U);
	sil_wrw_mem((void *)ESP32C5_TIMG_WDTWPROTECT(timg_base), 0U);
}

/*
 *  【実施32】CPUクロックの明示的切替え（XTAL→PLL_F240M÷3，レジスタ
 *  設定はbootloader_clock_configure(80MHz)相当だが実測は96MHz——
 *  下記・esp32c5.hのCORE_CLK_MHZコメント参照）
 *
 *  背景：docs/c5-bringup.md 実施32。JTAG実測で，ASP3のDirect BootはPCR
 *  SOC根クロックmux（PCR_SYSCLK_CONF.soc_clk_sel）がXTAL（=0）のまま
 *  一度も切り替わっておらず，実CPUクロックはXTAL48MHz直結（実測47.96〜
 *  48.00MHz，mcycle対SYSTIMER 16MHzの二点法・WiFi有無2ビルド×独立2回で
 *  再現）と判明した——旧「192MHz実機確定」（実施03）は誤りだったか，
 *  あるいは何らかの経緯で後退したかは未確定（本ラウンドでは追跡しない）。
 *  stock（2nd-stageブートローダのbootloader_clock_configure()経由）は
 *  同じPCRレジスタでsoc_clk_sel=3(PLL_F240M)を使用する。
 *
 *  本関数はbootloader_clock_configure()のCPUクロック切替え部分
 *  （rtc_clk_init→rtc_clk_cpu_freq_set_config）のうち，ASP3の較正キー
 *  (A)判定実験（実施30のP4ハンドオフ＝ext_mem_init直後・sys_rtc_init前，
 *  すなわちbootloader_clock_configure完了直後の状態）に対応する構成，
 *  すなわちCONFIG_BOOTLOADER_CPU_CLK_FREQ_MHZ=80（stock実測sdkconfigで
 *  確認済み）と同じ「PLL_F240Mソース・CPUディバイダ3・AHBディバイダ6
 *  ＝CPU80MHz/AHB40MHz」を再現する（rtc_clk_cpu_freq_to_pll_240_mhz()
 *  のAHBディバイダは要求CPU周波数に関わらず常に6固定であることをソース
 *  で確認済み）。app側のesp_clk_init()相当（240MHzへのさらなる昇格・
 *  esp_perip_clk_init）は対象外（次段，(B)scan/RXキーの移植で扱う）。
 *
 *  安全設計（JTAG実測を踏まえた最小構成）：
 *  - BBPLLの較正状態はI2C_ANA_MST_ANA_CONF0_REG bit24(CAL_DONE)で確認
 *    してから分岐する。ASP3の現在の較正ハング状態でCAL_DONE=1（2/2実測，
 *    ROMが既に較正を完了させている）ことをJTAGで確認済みのため，通常は
 *    再較正ループを通らない（`while(!cal_done);`という無条件待ちループを
 *    ハング状態のまま埋め込むリスクを避ける）。もしCAL_DONE=0の場合の
 *    フォールバックとして，タイムアウト付きの較正シーケンス
 *    （clk_ll_bbpll_calibration_start/stop相当）も用意する
 *    （無限待ちを避けるため上限ループ回数を設ける——rtc_clk.cの
 *    while(!is_done)は無条件待ちだが，ASP3では安全側に倒す）。
 *  - PMU_IMM_HP_CK_POWER_REG（0x600B00CC）はWT（write-trigger）型の
 *    自己クリアレジスタで，clk_ll_bbpll_enable()相当のtie-highパルス
 *    （XPD_BBPLL/XPD_BBPLL_I2C/XPD_BB_I2C/GLOBAL_BBPLL_ICG）を無条件に
 *    一度発行する（安全：自己クリア・読み戻し不能だが書込み自体に副作用
 *    リスクなし，実施23が試験した0x600B0014＝FSM影武者レジスタとは別の
 *    実効レジスタ）。
 *  - ディバイダ設定→ソース切替え→bus_clk_update（自己クリア型トリガ）の
 *    順序はrtc_clk_cpu_freq_to_pll_240_mhz()のとおり保持する。
 */
#define ESP32C5_R32_PCR_SYSCLK_CONF        (ESP32C5_PCR_BASE + 0x110U)
#define ESP32C5_R32_PCR_CPU_FREQ_CONF      (ESP32C5_PCR_BASE + 0x118U)
#define ESP32C5_R32_PCR_AHB_FREQ_CONF      (ESP32C5_PCR_BASE + 0x11CU)
#define ESP32C5_R32_PCR_BUS_CLK_UPDATE     (ESP32C5_PCR_BASE + 0x144U)
#define ESP32C5_R32_PMU_IMM_HP_CK_POWER    0x600B00CCU
#define ESP32C5_R32_I2C_ANA_MST_ANA_CONF0  0x600AF818U

