exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/target_kernel_impl.c
#define ESP32C5_R32_PMU_TIE_HIGH_GLOBAL_BBPLL_ICG  (1U << 25)
#define ESP32C5_R32_PMU_TIE_HIGH_XPD_BB_I2C        (1U << 28)
#define ESP32C5_R32_PMU_TIE_HIGH_XPD_BBPLL_I2C     (1U << 29)
#define ESP32C5_R32_PMU_TIE_HIGH_XPD_BBPLL         (1U << 30)
#define ESP32C5_R32_I2C_MST_BBPLL_CAL_DONE         (1U << 24)

/*
 *  【実施34】CPUディバイダ（stockのCONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240，
 *  `stock_scan/sdkconfig`実測で確認済み＝ESP-IDF既定の最終動作周波数）。
 *  PLL_F240Mソースは（BBPLL 480MHz較正が正しければ）ネット240MHzのため，
 *  cpu_divider=1で240MHz・cpu_divider=3で80MHz（bootloader相当，中間
 *  検証用）。AHBディバイダはrtc_clk_cpu_freq_to_pll_240_mhz()のとおり
 *  要求CPU周波数に関わらず常に6固定（40MHz，制約cpu_div<=ahb_div かつ
 *  ahb_div%cpu_div==0はcpu_div=1/3のいずれでも満たす）。
 *  段階検証（docs/c5-bringup.md実施34）：まず3（80MHz，安全側）でBBPLL
 *  修正の効果を実測確認してから1（240MHz，ESP-IDF標準・最終構成）へ
 *  切替えた。
 */
#define ESP32C5_R34_CPU_DIVIDER   1U   /* 【実施34最終値】240MHz＝ESP-IDF標準（stock既定CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240と同一）。
										 * 80MHz(div=3)段階でBBPLL修正後の実測79.9934/80.0095MHzを確認済み（2/2）。 */
#define ESP32C5_R34_AHB_DIVIDER   6U

static void esp32c5_r34_bbpll_configure_480mhz(void);
#ifdef ESP32C5_R40_CLKREORDER
static void esp32c5_r34_modem_icg_enable_min(void);
static void esp32c5_r40_modem_icg_disable_bracket(void);
#endif /* ESP32C5_R40_CLKREORDER */
#ifdef ESP32C5_R42_APMFIX
static void esp32c5_r42_apm_unblock(void);
#endif /* ESP32C5_R42_APMFIX */

/*
 *  【実施35】esp_clk_init()／esp_clk_tree_initialize()の残余効果の移植
 *  （docs/c5-bringup.md実施35）。実施32/34はesp_clk_init()のうち「CPU
 *  周波数切替え」（rtc_clk_cpu_freq_set_config，末尾の1項目）だけを
 *  移植済みで，それより前の項目（RTC_FAST_CLK源選択・RTC_SLOW_CLK源
 *  選択＋較正値保存）は未移植のまま残っていた。実機JTAG差分確認
 *  （stock=ESP-IDF標準ブート列 vs ASP3冷間，2/2再現）で下記2件の
 *  静的差分を確認済み：
 *
 *  1. LP_CLKRST_LP_CLK_CONF.fast_clk_sel（0x600B0400 bits[3:2]）：
 *     ASP3＝1（XTAL_D2，リセット既定値のまま未変更）／stock＝0（RC_FAST，
 *     esp_clk_init()のrtc_clk_fast_src_set(RC_FAST)相当，既定
 *     CONFIG_RTC_FAST_CLK_SRC_RC_FASTで確認）。
 *  2. RTC_SLOW_CLK_CAL_REG（=LP_AON_STORE1，0x600B1004）：
 *     ASP3＝0x00000000（一度も書込まれていない）／stock＝0x00358b20
 *     （esp_clk_init()のselect_rtc_slow_clk()内，rtc_clk_cal()による
 *     実測較正値をesp_clk_slowclk_cal_set()が保存．Q13.19固定小数点，
 *     マイクロ秒／サイクル）。
 *
 *  advisor査読：promisc_rx_count=0（実施33/34）という「タイミング定数の
 *  誤りというより受信経路そのものが無反応」という症状の性質からは，
 *  2（RTC_SLOW_CLK較正値）よりも1（RTC_FAST_CLK源，PMU/LPドメインの
 *  電源状態機械に絡む可能性）を先に試すべきとの指摘を受け，本ラウンドは
 *  1→2の順で1候補ずつ加算する。
 *
 *  【実施35・候補1の実機結果】esp32c5_r35_rtc_fast_clk_select()を単独で
 *  加算した冷間Direct Boot・独立2回のRTSリセット試行で，JTAG読み戻しに
 *  よりfast_clk_sel=0（RC_FAST，stock一致）へ切り替わったことを確認した
 *  上で，AP検出は依然`0 APs found`のまま（2/2）——**候補1単独では
 *  refute**。次段（候補2）を試す前提として，候補1は「正しさの上では
 *  stockに合わせる価値がある」ため実装は残したままとする（無害・
 *  他の副作用も観測されず）。
 *

 *  なお，PMU LP_ACTIVE.clk_power（0x600B00AC，xpd_fosc等）はJTAG差分
 *  確認の結果ASP3=stock=0x40000000で完全一致（ROM/PMUのPOR既定値が
 *  既にesp_clk_init()の目標値と一致していたと判明）——**候補から除外
 *  済み**（porting不要，rigor docの「既に一致する候補への移植は
 *  無駄働き」を回避）。
 */
#define ESP32C5_R35_LP_CLKRST_LP_CLK_CONF          0x600B0400U
#define ESP32C5_R35_LP_CLKRST_FAST_CLK_SEL_M       (0x3U << 2)
#define ESP32C5_R35_LP_CLKRST_FAST_CLK_SEL_RC_FAST (0x0U << 2)

/*
 *  候補1：RTC_FAST_CLK源をリセット既定のXTAL_D2からRC_FASTへ切替え
 *  （clk_ll_rtc_fast_set_src(SOC_RTC_FAST_CLK_SRC_RC_FAST)相当）。
 *  他ビット（slow_clk_selは既にstockと同じRC_SLOW=0）を保持する
 *  masked read-modify-writeとする。
 */
static void
esp32c5_r35_rtc_fast_clk_select(void)
{
	uint32_t	v;

	v = sil_rew_mem((void *)ESP32C5_R35_LP_CLKRST_LP_CLK_CONF);
	v &= ~ESP32C5_R35_LP_CLKRST_FAST_CLK_SEL_M;
	v |= ESP32C5_R35_LP_CLKRST_FAST_CLK_SEL_RC_FAST;
	sil_wrw_mem((void *)ESP32C5_R35_LP_CLKRST_LP_CLK_CONF, v);
}

/*
 *  候補2：RTC_SLOW_CLK_CAL_REG（esp_clk_slowclk_cal_set()相当）。
 *
 *  正規の実装（select_rtc_slow_clk()のrtc_clk_cal()）は，主XTAL
 *  （SYSTIMER相当の高精度基準）を用いてRTC_SLOW_CLKの実測サイクル数を
 *  数百サイクル分カウントし，Q13.19固定小数点のus/サイクル値を算出する
 *  もので，実装コストと実機ハングリスクが候補1より高い。task手順の
 *  「固定値書込みでまず因果を確認→効けば正式な較正実装へ」の2段構えに
 *  従い，本段階では**stockの実測値をそのまま定数として注入**し，
 *  この経路が実際にAP検出を左右するかどうかをまず安価に確認する
 *  （効かなければ正式実装は不要，効けば次段でrtc_clk_cal()相当の実測
 *  ルーチンへ格上げする）。
 *
 *  注入値0x00358b20は，stock ESP-IDF v6.1 examples/wifi/scan
 *  （esp32c5，本ラウンドでC5#1へ再ビルド・再フラッシュして採取，
 *  RTSリセット後T=0.3s/6.0sの独立読み取り2点・独立2回のRTSリセット
 *  試行で全て同一値，安定）の実測値であり，ASP3自身のRC_SLOW発振器の
 *  真の周波数とは一致しない可能性がある（同一チップでも発振器個体差・
 *  温度依存があるため，本来は自己測定が正しい）——本段階はあくまで
 *  「この値域のレジスタが0か非ゼロかでAP検出が変わるか」という因果の
 *  有無を安価に確認する目的の暫定実装であることに注意。
 */
#define ESP32C5_R35_RTC_SLOW_CLK_CAL_REG   0x600B1004U /* LP_AON_STORE1 */
#define ESP32C5_R35_RTC_SLOW_CLK_CAL_FIXED 0x00358b20U /* stock実測値（本ラウンド採取） */

static void
esp32c5_r35_rtc_slowclk_cal_set_fixed(void)
{
	sil_wrw_mem((void *)ESP32C5_R35_RTC_SLOW_CLK_CAL_REG,
				ESP32C5_R35_RTC_SLOW_CLK_CAL_FIXED);
}

/*
 *  候補3：PMU HP_MODEM電源/クロックバンク（＋HP_ACTIVE.HP_REGULATOR0）
 *  の未初期化（docs/c5-bringup.md実施35）。
 *
 *  背景：候補1・候補2を実装しても実機でAP検出は変わらなかった（0 APs
 *  found，2/2）ため，advisor指摘に従いesp_clk_init()の外側まで対象を
 *  広げ，実施29の11ブロックJTAGスナップショット相当の広域差分比較を
 *  実施した（本ラウンド，`blockdump.py`）。その結果，PMU
 *  HP_MODEMバンク（`pmu_hp_system_init()`がPMU_MODE_HP_MODEMモードで
 *  書込む7レジスタ，0x600B0034〜0x600B005C）が**ASP3では一度も書込まれず
 *  ほぼ全ゼロのまま**（対してstockは`pmu_init()`実行後の実測値が全て
 *  非ゼロ）という，実施21〜24が検討していなかった新規の大きな差分を
 *  発見した——実施23「決定実験C」はHP_ACTIVEバンクの一部フィールド
 *  （CK_POWER等）のみを対象としており，HP_MODEMバンク（PMUがモデム
 *  電源状態へ遷移した際に実際に使われるICG/クロック/電源設定）は
 *  当時の較正キー(A)調査の範囲外だった。HP_ACTIVE.HP_REGULATOR0
 *  （0x600B0028）にも軽微な差分がある。
 *
 *  正式には`pmu_hp_system_param_default(PMU_MODE_HP_MODEM, ...)`の
 *  デフォルトパラメータテーブル（`pmu_param.c`，eFuse依存項目を含む）を
 *  再現すべきだが，実装コストが高いため，task手順の2段構えに従い
 *  **本段階ではstockの実測値をそのまま定数として注入**し，このバンクが
 *  AP検出を左右するかをまず安価に確認する。
 *
 *  実施30のP1/P4ハンドオフ実験との整合性の注記：P1（stockの
 *  `system_early_init()`直前，すなわちstockの`pmu_init()`実行**後**）は
 *  RX恒久ゼロだった。もしHP_MODEMバンクの初期化だけで十分なら，P1でも
 *  RXが生きるはずだが実際には生きなかった——つまりHP_MODEMバンクの
 *  初期化は**単独では不十分**（必要条件の一つに過ぎない可能性が高い）。
 *  本候補は，候補1・2（esp_clk_init由来）と**併せて**初めてP2/P3相当の
 *  状態に近づく，という仮説の下で追加する（1つずつ加算する原則には
 *  反するが，候補1・2は個別にAP検出への効果ゼロと確定済みのため，
 *  「まだ試していない別のカテゴリの差分」を追加する本段は妥当な次段
 *  と判断——advisor指摘のとおり）。
 */
#define ESP32C5_R35_PMU_HP_ACTIVE_HP_REGULATOR0   0x600B0028U
#define ESP32C5_R35_PMU_HP_MODEM_DIG_POWER        0x600B0034U
#define ESP32C5_R35_PMU_HP_MODEM_ICG_HP_FUNC      0x600B0038U
#define ESP32C5_R35_PMU_HP_MODEM_ICG_HP_APB       0x600B003CU
#define ESP32C5_R35_PMU_HP_MODEM_ICG_MODEM        0x600B0040U
#define ESP32C5_R35_PMU_HP_MODEM_HP_SYS_CNTL      0x600B0044U
#define ESP32C5_R35_PMU_HP_MODEM_HP_CK_POWER      0x600B0048U
#define ESP32C5_R35_PMU_HP_MODEM_BACKUP           0x600B0050U
#define ESP32C5_R35_PMU_HP_MODEM_BACKUP_CLK       0x600B0054U
#define ESP32C5_R35_PMU_HP_MODEM_SYSCLK           0x600B0058U
#define ESP32C5_R35_PMU_HP_MODEM_HP_REGULATOR0    0x600B005CU

/*  stock実測値（本ラウンド，`stock_scan`実行中，RTSリセット後T=6.0s，
 *  独立2回のRTSリセット試行いずれも同一値）。  */
#define ESP32C5_R35_FIXED_HP_ACTIVE_HP_REGULATOR0 0xc004afd0U
#define ESP32C5_R35_FIXED_HP_MODEM_DIG_POWER      0x20000000U
#define ESP32C5_R35_FIXED_HP_MODEM_ICG_HP_FUNC    0x00100000U
#define ESP32C5_R35_FIXED_HP_MODEM_ICG_HP_APB     0x00000200U
#define ESP32C5_R35_FIXED_HP_MODEM_ICG_MODEM      0x40000000U
#define ESP32C5_R35_FIXED_HP_MODEM_HP_SYS_CNTL    0x31000000U
#define ESP32C5_R35_FIXED_HP_MODEM_HP_CK_POWER    0x70000000U
#define ESP32C5_R35_FIXED_HP_MODEM_BACKUP         0x00100010U
#define ESP32C5_R35_FIXED_HP_MODEM_BACKUP_CLK     0xffffffffU
#define ESP32C5_R35_FIXED_HP_MODEM_SYSCLK         0xb8000000U
#define ESP32C5_R35_FIXED_HP_MODEM_HP_REGULATOR0  0xc0048000U

