exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/target_kernel_impl.c
/*  pmu_ll_imm_update_dig_icg_modem_code(true)／
 *  pmu_ll_imm_update_dig_icg_switch(true)相当のラッチパルス
 *  （実施34のesp32c5_r34_modem_icg_enable_min()と同一レジスタ，
 *  自己クリア型・重複発行は無害）。  */
#define ESP32C5_R35_PMU_IMM_MODEM_ICG      0x600B00DCU
#define ESP32C5_R35_PMU_IMM_SLEEP_SYSCLK   0x600B00D0U

static void
esp32c5_r35_pmu_hp_modem_bank_fixed(void)
{
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_ACTIVE_HP_REGULATOR0,
				ESP32C5_R35_FIXED_HP_ACTIVE_HP_REGULATOR0);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_MODEM_DIG_POWER,
				ESP32C5_R35_FIXED_HP_MODEM_DIG_POWER);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_MODEM_ICG_HP_FUNC,
				ESP32C5_R35_FIXED_HP_MODEM_ICG_HP_FUNC);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_MODEM_ICG_HP_APB,
				ESP32C5_R35_FIXED_HP_MODEM_ICG_HP_APB);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_MODEM_ICG_MODEM,
				ESP32C5_R35_FIXED_HP_MODEM_ICG_MODEM);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_MODEM_HP_SYS_CNTL,
				ESP32C5_R35_FIXED_HP_MODEM_HP_SYS_CNTL);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_MODEM_HP_CK_POWER,
				ESP32C5_R35_FIXED_HP_MODEM_HP_CK_POWER);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_MODEM_BACKUP,
				ESP32C5_R35_FIXED_HP_MODEM_BACKUP);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_MODEM_BACKUP_CLK,
				ESP32C5_R35_FIXED_HP_MODEM_BACKUP_CLK);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_MODEM_SYSCLK,
				ESP32C5_R35_FIXED_HP_MODEM_SYSCLK);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_MODEM_HP_REGULATOR0,
				ESP32C5_R35_FIXED_HP_MODEM_HP_REGULATOR0);

	/*  ラッチパルス（自己クリア型，実施34と同一レジスタへの重複発行は
	 *  無害）。  */
	sil_wrw_mem((void *)ESP32C5_R35_PMU_IMM_MODEM_ICG, (1U << 31));
	sil_wrw_mem((void *)ESP32C5_R35_PMU_IMM_SLEEP_SYSCLK, (1U << 28));
}

/*
 *  候補4：PMU HP_SLEEPバンク（`pmu_hp_system_init()`のPMU_MODE_HP_SLEEP
 *  版，`pmu_init()`の完全な3モード反復のうち最後の1つ）。
 *
 *  背景：候補1〜3を実装しても実機でAP検出は変わらなかったため，
 *  advisor指摘に従い「クロスカーネル・ハンドオフ実験の再構築」を実施
 *  （docs/c5-bringup.md実施35）。stockホストからノーリセットで（本
 *  ビルド自身の候補1〜3処理は`HANDOFF_SKIP_CLOCK_INIT`でスキップして）
 *  ジャンプしたところ，**同一のASP3ゲストコードでAP検出（20/24/21/23
 *  APs，独立2回）に成功**——実施29の headjump 結果を再現した。この
 *  「動くソフトウェア（ハンドオフ）」対「動かないソフトウェア（候補
 *  1〜3込みcold boot）」という**同一ソフトウェア条件下**の広域レジスタ
 *  再比較で，候補3（HP_MODEMバンク）は正しく再現できていたことが確認
 *  できた一方，**HP_SLEEPバンク（`pmu_hp_system_init()`が反復する3
 *  モードのうち残る1つ）が未移植のまま**であることが判明した——
 *  `pmu_init()`は`PMU_MODE_HP_ACTIVE`・`PMU_MODE_HP_MODEM`・
 *  `PMU_MODE_HP_SLEEP`の3モードを同一ループで設定するが，候補3は
 *  HP_MODEMとHP_ACTIVE.HP_REGULATOR0のみを対象としており，HP_SLEEP
 *  バンク（0x600B0068〜0x600B0098，9レジスタ）を見落としていた。
 *
 *  Direct Bootは実際のsleepモードへ遷移しないため一見無関係に見えるが，
 *  `pmu_hp_system_init()`はモードに関わらず末尾で
 *  `pmu_ll_hp_set_sleep_protect_mode(..., PMU_SLEEP_PROTECT_HP_LP_SLEEP)`
 *  を呼ぶ等，3モード全体が一体のPMU設定として扱われる実装になっている
 *  ため，HP_SLEEPバンクが未設定のままだとPMU全体の設定が不完全な状態に
 *  留まっている可能性がある——候補3と同じくstock実測値を固定注入する
 *  形で追加する。
 */
#define ESP32C5_R35_PMU_HP_SLEEP_DIG_POWER      0x600B0068U
#define ESP32C5_R35_PMU_HP_SLEEP_ICG_HP_FUNC    0x600B006CU
#define ESP32C5_R35_PMU_HP_SLEEP_ICG_HP_APB     0x600B0070U
#define ESP32C5_R35_PMU_HP_SLEEP_HP_SYS_CNTL    0x600B0078U
#define ESP32C5_R35_PMU_HP_SLEEP_HP_CK_POWER    0x600B007CU
#define ESP32C5_R35_PMU_HP_SLEEP_BACKUP         0x600B0084U
#define ESP32C5_R35_PMU_HP_SLEEP_BACKUP_CLK     0x600B0088U
#define ESP32C5_R35_PMU_HP_SLEEP_SYSCLK         0x600B008CU
#define ESP32C5_R35_PMU_HP_SLEEP_HP_REGULATOR0  0x600B0090U
#define ESP32C5_R35_PMU_HP_SLEEP_XTAL           0x600B0098U

/*  stock実測値（実施35のクロスカーネル・ハンドオフ実験，成功後の
 *  ASP3ゲスト実行中，T=6.0s，独立2回のRTSリセット試行いずれも同一値）。  */
#define ESP32C5_R35_FIXED_HP_SLEEP_DIG_POWER     0x08200000U
#define ESP32C5_R35_FIXED_HP_SLEEP_ICG_HP_FUNC   0x00000000U
#define ESP32C5_R35_FIXED_HP_SLEEP_ICG_HP_APB    0x00000000U
#define ESP32C5_R35_FIXED_HP_SLEEP_HP_SYS_CNTL   0x39000000U
#define ESP32C5_R35_FIXED_HP_SLEEP_HP_CK_POWER   0x1c000000U
#define ESP32C5_R35_FIXED_HP_SLEEP_BACKUP        0x21100200U
#define ESP32C5_R35_FIXED_HP_SLEEP_BACKUP_CLK    0xffffffffU
#define ESP32C5_R35_FIXED_HP_SLEEP_SYSCLK        0x30000000U
#define ESP32C5_R35_FIXED_HP_SLEEP_HP_REGULATOR0 0x08048000U
#define ESP32C5_R35_FIXED_HP_SLEEP_XTAL          0x00000000U

static void
esp32c5_r35_pmu_hp_sleep_bank_fixed(void)
{
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_SLEEP_DIG_POWER,
				ESP32C5_R35_FIXED_HP_SLEEP_DIG_POWER);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_SLEEP_ICG_HP_FUNC,
				ESP32C5_R35_FIXED_HP_SLEEP_ICG_HP_FUNC);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_SLEEP_ICG_HP_APB,
				ESP32C5_R35_FIXED_HP_SLEEP_ICG_HP_APB);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_SLEEP_HP_SYS_CNTL,
				ESP32C5_R35_FIXED_HP_SLEEP_HP_SYS_CNTL);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_SLEEP_HP_CK_POWER,
				ESP32C5_R35_FIXED_HP_SLEEP_HP_CK_POWER);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_SLEEP_BACKUP,
				ESP32C5_R35_FIXED_HP_SLEEP_BACKUP);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_SLEEP_BACKUP_CLK,
				ESP32C5_R35_FIXED_HP_SLEEP_BACKUP_CLK);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_SLEEP_SYSCLK,
				ESP32C5_R35_FIXED_HP_SLEEP_SYSCLK);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_SLEEP_HP_REGULATOR0,
				ESP32C5_R35_FIXED_HP_SLEEP_HP_REGULATOR0);
	sil_wrw_mem((void *)ESP32C5_R35_PMU_HP_SLEEP_XTAL,
				ESP32C5_R35_FIXED_HP_SLEEP_XTAL);

	/*  ラッチパルス（候補3と同一，重複発行は無害）。  */
	sil_wrw_mem((void *)ESP32C5_R35_PMU_IMM_MODEM_ICG, (1U << 31));
	sil_wrw_mem((void *)ESP32C5_R35_PMU_IMM_SLEEP_SYSCLK, (1U << 28));
}

#ifdef ESP32C5_R41_COMBINED19
/*
 *  【実施41】候補2（外部AI回答tmp/external_ai_c5_answer_fable.md）：
 *  実施35 10節が確定した「未説明の差分19語」（asp3cold_full_cand4_boot1.
 *  json vs handoff_blocks_boot1.json，本ラウンドでスクラッチ資産から
 *  再計算し直し完全一致を確認済み）を，個別注入ではなく**一括**で冷間
 *  ASP3へ注入し，組合せマスキング（個別には効かないが複数同時なら
 *  効く，という可能性）の有無を判定する。
 *
 *  19語のうち5語はESP-IDF v6.1のレジスタヘッダ（soc/pmu_reg.h・
 *  soc/lpperi_reg.h・soc/pvt_reg.h）でビット単位に照合した結果，
 *  差分ビットが**読取専用（RO）**であると確定したため注入対象から
 *  除外した（実施35時点の分類より精密化——特にLPPERI+0x8/+0x28は
 *  ヘッダ上「RNG_DATA/RNG_DATA_SYNC」＝生きたRNGエントロピー出力その
 *  ものであり，LPPERI+0x24もR/W設定ビット[11:0]は両条件で完全一致・
 *  差分は純粋にRO統計カウンタ[31:24](RNG_SAMPLE_CNT)——実施22の
 *  「BOD/グリッチ検出器ノイズ」という分類は方向としては正しかったが，
 *  正確には「RNGブロックの生きた出力/カウンタ」だったと判明）：
 *    - PMU_CLK_STATE0（0x600B0198）：全ビットRO（クロックmux状態表示）
 *    - PVT_MONITOR（0x600190D8）：差分ビット(delay_num_o/timing_err)が
 *      RO，R/Wビット(monitor_en/delay_limit)は両条件で既に完全一致
 *    - LPPERI_RNG_DATA（0x600B2808）：全ビットRO（RNG生データ）
 *    - LPPERI_RNG_DATA_SYNC（0x600B2828）：全ビットRO（RNG同期データ）
 *    - LPPERI_RNG_CFG（0x600B2824）：差分はRO統計カウンタのみ，R/W
 *      設定ビットは既に一致（このアドレスは実施31の
 *      esp32c5_r31_bootloader_random_cycle()が両条件で同一に書込む
 *      対象でもあり，「同一ソフトウェアで同一に駆動されている」という
 *      実施35 7〜8節の前提とも整合する）
 *
 *  残り14語がR/W（設定可能）と確認できたため注入対象とする。値は
 *  ハンドオフ(WORKS)側の実測スナップショット（本ラウンドで
 *  handoff_blocks_boot1.jsonから再計算・確認）。PMU_HP_ACTIVE_
 *  HP_REGULATOR0とLP_AON_STORE1(RTC_SLOW_CLK_CAL)は実施35で個別に
 *  既にcausal refute済み（前者はPVT自動dbiasループが書込み直後に
 *  上書きすることも確認済み——本関数の直後読み戻しでは正しい値が
 *  一旦観測される可能性があるが，esp_wifi_init直前の再読取り
 *  （esp32c5_r41_dump_live，wifi_scan.c側）で保持されているかを
 *  別途確認する）。他12語は個別注入は未実施（実施22/23の「机上棄却」
 *  ＝レジスタ意味論からの推定のみ）——本ラウンドが初めての実注入。
 *
 *  ★安全上の注意（実施23/24の既知の罠）：PD_TOP/HPAON/HPCPU/LPPERI
 *  force解除（本表の4語）は，実施23で「WiFi init時点の後付け移植で
 *  書くとJTAG捕捉のブート到達性が悪化する」現象が報告され，実施24が
 *  UART専用（JTAG不使用）で症状不変（causal refute側）を確認したのみ
 *  で，JTAG特有の再現性は未検証のまま`#if 0`保留になっていた。本関数
 *  はJTAGでの読み戻し確認を必須としないソフト自己完結読み戻し（本関数
 *  自身のimmediate readback＋LP_AON STORE2-4への鏡写し）を主手段とし，
 *  外部JTAGでのhalt/mdwは別プロセス（reset_and_read.py，起動完了後の
 *  非同期アタッチ）で行うことで，実施23が踏んだ「JTAG halt自体が
 *  書込みタイミングと絡む」経路を避ける。
 */
struct esp32c5_r41_word {
	uint32_t	addr;
	uint32_t	handoff_val;
};

static const struct esp32c5_r41_word esp32c5_r41_words[14] = {
	/*  実施35候補3で個別refute済み・PVT自動dbiasループが上書きする
	 *  ことも確認済み（動的値，「ハンドオフ側スナップショット」を
	 *  注入する規約に従う）。  */
	{ 0x600B0028U, 0xC004AFD0U },	/* PMU_HP_ACTIVE_HP_REGULATOR0 */
	/*  実施23/24で個別refute済み（PD_TOP/HPAON/HPCPU/LPPERI force解除
	 *  クラスタ，安全上の注意は上記コメント参照）。  */
	{ 0x600B00F8U, 0x00000000U },	/* PMU_POWER_PD_TOP_CNTL */
	{ 0x600B00FCU, 0x00000000U },	/* PMU_POWER_PD_HPAON_CNTL */
	{ 0x600B0100U, 0x00000000U },	/* PMU_POWER_PD_HPCPU_CNTL */
	{ 0x600B010CU, 0x00000000U },	/* PMU_POWER_PD_LPPERI_CNTL */
	{ 0x600B0110U, 0xF0000000U },	/* PMU_POWER_PD_MEM_CNTL（同クラスタ） */
	/*  個別注入は未実施（実施22/23の机上棄却のみ）。本ラウンドが
	 *  初めての実注入。  */
	{ 0x600B0130U, 0x00020000U },	/* PMU_SLP_WAKEUP_CNTL3 */
	{ 0x600B0404U, 0x00000000U },	/* LP_CLKRST_LP_CLK_PO_EN */
	{ 0x600B0418U, 0x19000000U },	/* LP_CLKRST_FOSC_CNTL(DFREQ 172→100) */
	{ 0x600B2800U, 0x41000000U },	/* LPPERI_CLK_EN_REG */
	{ 0x600B2C00U, 0x6FFC02C0U },	/* LP_ANA_BOD_MODE0_CNTL_REG */
	{ 0x600B2C0CU, 0xFFFFFFC1U },	/* LP_ANA_FIB_ENABLE_REG */
	{ 0x600B2C18U, 0x80000000U },	/* LP_ANA_INT_ENA_REG */
	/*  実施35候補2で個別refute済み（値は本ラウンドのハンドオフ実測へ
	 *  更新——実施35時点の固定値0x358b20と僅かに異なる，オシレータの
	 *  ブート間variationの範囲内）。  */
	{ 0x600B1004U, 0x00359755U },	/* LP_AON_STORE1(RTC_SLOW_CLK_CAL) */
};

