exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/target_kernel_impl.c
#define ESP32C5_R41_LP_AON_STORE2   0x600B1008U
#define ESP32C5_R41_LP_AON_STORE3   0x600B100CU
#define ESP32C5_R41_LP_AON_STORE4   0x600B1010U
#define ESP32C5_R41_MARKER          0xC0FFEE41U

uint32_t	esp32c5_r41_readback[14];
uint32_t	esp32c5_r41_mismatch_count;
uint32_t	esp32c5_r41_first_mismatch_addr;

/*
 *  14語を書込み→即座に読み戻して確認する。呼出し位置は2変種
 *  （ESP32C5_R41_CALL_BOOTHOOK＝hardware_init_hook末尾／
 *  ESP32C5_R41_CALL_ESPWIFIINIT＝wifi_scan.cのesp_wifi_init直前）。
 *  結果は.bss配列（esp32c5_r41_readback[]）に加え，LP_AON STORE2〜4
 *  （ハードウェアレジスタ，.bssクリアの影響を受けない）にも鏡写しする
 *  ——boot-hook末尾変種では実施36が学習したとおり.bssがこの後の
 *  カーネル起動時クリアで消える可能性があるため。
 */
void
esp32c5_r41_combined_seed(void)
{
	uint32_t	i;
	uint32_t	v;
	uint32_t	mismatch = 0U;
	uint32_t	first_addr = 0xFFFFFFFFU;

	for (i = 0U; i < 14U; i++) {
		sil_wrw_mem((void *)esp32c5_r41_words[i].addr,
					esp32c5_r41_words[i].handoff_val);
		v = sil_rew_mem((void *)esp32c5_r41_words[i].addr);
		esp32c5_r41_readback[i] = v;
		if (v != esp32c5_r41_words[i].handoff_val) {
			if (mismatch == 0U) {
				first_addr = esp32c5_r41_words[i].addr;
			}
			mismatch++;
		}
	}
	esp32c5_r41_mismatch_count = mismatch;
	esp32c5_r41_first_mismatch_addr = first_addr;

	sil_wrw_mem((void *)ESP32C5_R41_LP_AON_STORE2, mismatch);
	sil_wrw_mem((void *)ESP32C5_R41_LP_AON_STORE3, ESP32C5_R41_MARKER);
	sil_wrw_mem((void *)ESP32C5_R41_LP_AON_STORE4, first_addr);
}

/*
 *  scan/esp_wifi_init直前の「生」再読取り（.bssではなく実レジスタを
 *  直接読む）。注入がesp_wifi_init直前（同一呼出しの直後）でも
 *  boot-hook末尾（較正・PVTループ等を経た後）でも，較正直前の時点で
 *  実際に14語が保持されているかを確認する共通ダンプ関数。
 */
uint32_t	esp32c5_r41_live_readback[14];
uint32_t	esp32c5_r41_live_mismatch_count;

void
esp32c5_r41_dump_live(void)
{
	uint32_t	i;
	uint32_t	v;
	uint32_t	mismatch = 0U;

	for (i = 0U; i < 14U; i++) {
		v = sil_rew_mem((void *)esp32c5_r41_words[i].addr);
		esp32c5_r41_live_readback[i] = v;
		if (v != esp32c5_r41_words[i].handoff_val) {
			mismatch++;
		}
	}
	esp32c5_r41_live_mismatch_count = mismatch;
}
#endif /* ESP32C5_R41_COMBINED19 */

static void
esp32c5_r32_cpu_clock_switch(void)
{
	uint32_t	v;
	uint32_t	i;

	/*
	 *  BBPLL/BB-I2Cのアナログ電源をIMM（即時）レジスタで確実にtie-high
	 *  する（clk_ll_bbpll_enable()相当，自己クリア型・無条件で安全）。
	 */
	sil_wrw_mem((void *)ESP32C5_R32_PMU_IMM_HP_CK_POWER,
				ESP32C5_R32_PMU_TIE_HIGH_GLOBAL_BBPLL_ICG
				| ESP32C5_R32_PMU_TIE_HIGH_XPD_BB_I2C
				| ESP32C5_R32_PMU_TIE_HIGH_XPD_BBPLL_I2C
				| ESP32C5_R32_PMU_TIE_HIGH_XPD_BBPLL);

	/*
	 *  【実施34で変更】実施32はCAL_DONEビットが既に1（ROMが較正済み）の
	 *  場合は較正ループを完全にスキップしていたが，実施34のJTAG実測
	 *  （`r34_bbpll_read.py`）で「ROMは較正済みだが40MHz XTALプロファイル
	 *  を誤って使っており，実際には576MHz相当へロックしていた」ことが
	 *  判明した（div7_0=12・dr1=dr3=0を実測——48MHzプロファイルは
	 *  div7_0=10・dr1=dr3=1）。CAL_DONE=1は「較正が完了した」ことしか
	 *  示さず「正しい周波数へ較正された」ことは保証しないため，CAL_DONEの
	 *  値に関わらず無条件で`esp32c5_r34_bbpll_configure_480mhz()`
	 *  （regi2cによる48MHzプロファイルの明示書込み＋再較正）を実行する。
	 *  呼出し時点でCPUはまだXTAL直結（本関数はここでのみPLLソースへ
	 *  切り替える）ため，BBPLL再較正中の一時的な不定状態がCPU動作へ
	 *  影響することはない。
	 */
	esp32c5_r34_bbpll_configure_480mhz();

#ifdef ESP32C5_R40_CLKREORDER
	/*
	 *  【実施40】候補1段階(iii)：PCRのソース切替えパルスを打つ直前で
	 *  modem ICGを一旦無効化する（切替え瞬間だけmodem系クロックを
	 *  止めた状態にする）。
	 */
	esp32c5_r40_modem_icg_disable_bracket();
#endif /* ESP32C5_R40_CLKREORDER */

	/*
	 *  ディバイダ設定（rtc_clk_cpu_freq_to_pll_240_mhz(freq)相当）：
	 *  ソース切替え前に設定する（rtc_clk.cと同じ順序）。
	 */
	v = sil_rew_mem((void *)ESP32C5_R32_PCR_CPU_FREQ_CONF);
	v = (v & ~0xFFU) | (ESP32C5_R34_CPU_DIVIDER - 1U);
	sil_wrw_mem((void *)ESP32C5_R32_PCR_CPU_FREQ_CONF, v);

	v = sil_rew_mem((void *)ESP32C5_R32_PCR_AHB_FREQ_CONF);
	v = (v & ~0xFFU) | (ESP32C5_R34_AHB_DIVIDER - 1U);
	sil_wrw_mem((void *)ESP32C5_R32_PCR_AHB_FREQ_CONF, v);

	/*  ソース切替え：soc_clk_sel[17:16]=3(PLL_F240M)  */
	v = sil_rew_mem((void *)ESP32C5_R32_PCR_SYSCLK_CONF);
	v = (v & ~(0x3U << 16)) | (3U << 16);
	sil_wrw_mem((void *)ESP32C5_R32_PCR_SYSCLK_CONF, v);

	/*  bus_clk_update：R/W/WTC型自己クリアトリガ．HWが処理完了後に
	 *  自動で0へ戻るのを待つ（clk_ll_bus_update()相当，タイムアウト付き）  */
	sil_wrw_mem((void *)ESP32C5_R32_PCR_BUS_CLK_UPDATE, 1U);
	for (i = 0U; i < 2000000U; i++) {
		v = sil_rew_mem((void *)ESP32C5_R32_PCR_BUS_CLK_UPDATE);
		if ((v & 1U) == 0U) {
			break;
		}
	}

#ifdef ESP32C5_R40_CLKREORDER
	/*  ソース切替え完了後，modem ICGを再有効化（enable_minと同じ状態へ
	 *  戻す——esp_wifi_init経路でこの後さらに広いICGへ拡張される，
	 *  実施34/13と同型）。  */
	esp32c5_r34_modem_icg_enable_min();
#endif /* ESP32C5_R40_CLKREORDER */
}

/*
 *  【実施34】BBPLLの正規較正（regi2c I2C_BBPLLブロック，block=0x66）
 *
 *  背景：docs/c5-bringup.md 実施32/33/34。実施32はROMが既に較正済み
 *  （I2C_ANA_MST_ANA_CONF0.CAL_DONE=1）だったBBPLLをそのまま流用したが，
 *  実測CPU周波数は理論値80MHzに対し実測96MHz（＝1.2倍）というズレを
 *  残していた。実施34の事前JTAG読み（advisor指示のcheap disambiguator，
 *  実施14の手動regi2cリプレイ手法を再利用，`r34_bbpll_read.py`）で，
 *  block 0x66のreg3(OC_DIV_7_0)=0x0C(12)・reg5(DR1[2:0]/DR3[6:4])=0x00
 *  （dr1=0,dr3=0）を実測——これはhal `clk_tree_ll.h`の
 *  `clk_ll_bbpll_set_config()`が定義する**40MHz XTALプロファイル**
 *  （div7_0=12,dr1=0,dr3=0）そのものである。C5の実際のXTALは48MHz
 *  （プロファイルはdiv7_0=10,dr1=1,dr3=1）——ROMは40MHz用の分周設定で
 *  480MHzのつもりで較正してしまい，実際には480×(48/40)=576MHz相当へ
 *  ロックしていたと判明した（576/480=1.2＝実測96MHz/理論80MHzの比と
 *  正確に一致，advisorの予測どおり）。
 *
 *  本関数は`rtc_clk_bbpll_configure(48MHz, 480MHz)`
 *  （`hal/esp_hw_support/port/esp32c5/rtc_clk.c`）相当を，regi2cの
 *  実体（`hal/esp_hal_regi2c/esp32c5/regi2c_impl.c`の
 *  `_regi2c_impl_write`/`_regi2c_impl_write_mask`——実体はGPIO I2Cでは
 *  なくMMIOレジスタ`I2C_ANA_MST_I2C0/1_CTRL_REG`経由の疑似バス転送．
 *  実施14で確認済みのプロトコル）を`sil_*w_mem`で手動再現する形で
 *  移植した。ROM regi2c関数へのリンク（実施32のコメントで検討した
 *  代替案）は，B-0/B-1（WiFi無効）ビルドでROM ldを含まないため使えず，
 *  実施14の手動プロトコル（MMIO直叩き）はビルド形態に依存しないため
 *  こちらを採用した。
 *
 *  安全設計：
 *  - 全てのbusy-wait（regi2cトランザクション完了・CAL_DONE成立）に
 *    タイムアウト上限を設ける（無条件whileは採用しない，実施32と同じ
 *    方針）。
 *  - regi2cマスタクロック前提（`MODEM_LPCON_CLK_CONF` bit2
 *    `clk_i2c_mst_en`・`MODEM_SYSCON_CLK_CONF` bit12
 *    `clk_i2c_mst_sel_160m`，実施14で確認済みの前提条件）は，本関数
 *    自身が冒頭で（他のどの初期化より先に，WiFi有無に関わらず）
 *    OR書込みで有効化する——`ANALOG_CLOCK_ENABLE()`はBOOTLOADER_BUILD
 *    では恒久有効化戦略（no-op，`bootloader_hardware_init()`が起動時に
 *    一度有効化してそのまま）であり，ASP3のDirect Bootも同じ戦略
 *    （一度有効化して恒久的に維持）を採る。
 *  - `clk_ll_bbpll_calibration_start()`→`clk_ll_bbpll_set_config()`
 *    →`while(!is_done)`→`calibration_stop()`の順序をそのまま保持する
 *    （rtc_clk.cの`rtc_clk_bbpll_configure()`と同一順序——calibration_
 *    startが先，regi2cのdiv/dr/lref/href書込みはcalibration実行中に
 *    行う）。
 */
#define ESP32C5_R34_I2C_ANA_MST_BASE        0x600AF800U
#define ESP32C5_R34_I2C_ANA_MST_I2C0_CTRL   (ESP32C5_R34_I2C_ANA_MST_BASE + 0x00U)
#define ESP32C5_R34_I2C_ANA_MST_I2C1_CTRL   (ESP32C5_R34_I2C_ANA_MST_BASE + 0x04U)
#define ESP32C5_R34_I2C_ANA_MST_ANA_CONF1   (ESP32C5_R34_I2C_ANA_MST_BASE + 0x1CU)
#define ESP32C5_R34_I2C_ANA_MST_ANA_CONF2   (ESP32C5_R34_I2C_ANA_MST_BASE + 0x20U)
#define ESP32C5_R34_REGI2C_BUSY             (1U << 25)
#define ESP32C5_R34_REGI2C_WR_CNTL          (1U << 24)

