exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/target_kernel_impl.c
#define ESP32C5_R34_MODEM_LPCON_CLK_CONF    0x600AF018U
#define ESP32C5_R34_MODEM_LPCON_CLK_I2C_MST_EN  (1U << 2)
#define ESP32C5_R34_MODEM_SYSCON_CLK_CONF   0x600A9C04U  /* ESP32C5_R31_...と同一アドレス。
														   * TOPPERS_ESP32C5_WIFI非依存で
														   * 使うため本関数専用に再定義
														   * （実施31の定義はWiFi限定
														   * ガード内のため不可視）。 */

#define ESP32C5_R34_BBPLL_BLOCK              0x66U
#define ESP32C5_R34_BBPLL_MST_SEL_BIT        (1U << 9)   /* ANA_CONF2内，REGI2C_BBPLL_MST_SEL */
#define ESP32C5_R34_BBPLL_RD_MASK            (~(1U << 7) & 0x00FFFFFFU)  /* ANA_CONF1へ書く値 */

#define ESP32C5_R34_BBPLL_REG_OC_REF_DIV     2U  /* OC_DCHGP[6:4]|OC_REF_DIV[3:0]，full byte */
#define ESP32C5_R34_BBPLL_REG_OC_DIV_7_0     3U  /* full byte */
#define ESP32C5_R34_BBPLL_REG_DR             5U  /* OC_DR3[6:4]/OC_DR1[2:0]，masked */
#define ESP32C5_R34_BBPLL_REG_DHLREF         6U  /* OC_DLREF_SEL[7:6]/OC_DHREF_SEL[5:4]，masked */

/*
 *  【実施34・決定実験で発見】I2C_ANA_MST（regi2cマスタ）はMODEM_LPCON.
 *  clk_i2c_mst_enを立てるだけでは実際には動かない——ANA_CONF0/1/2の
 *  読み書きが恒久的に0x00000000のまま（regi2c_write()のbusy waitは
 *  「即座にクリアされる」ため一見成功して見えるが，実際にはANA_MST
 *  ブロック自体に機能クロックが供給されていないため何も起きていない）
 *  ことをJTAG実測で確認した。実施13が`esp_shim_modem_icg_init()`
 *  （`wifi/esp_wifi_adapter.c`）で発見・修正した「WIFIBBクロックの
 *  ICGゲート」と同じ機構——PMU HP_ACTIVEのicg_modem.code（0x600B000C
 *  bits[31:30]）がDirect Boot起動直後は0のままで，MODEM_SYSCON/
 *  MODEM_LPCONのCLK_CONF_POWER_ST（ICGコード別に「どのコード値で
 *  クロックを通すか」を指定するビットマップ）にはコード0が含まれない
 *  ため，機能クロックがゲートされたまま——が，I2C_MASTER ICGドメイン
 *  （regi2cマスタ自体）にもそのまま適用されると判明した。
 *  `esp_shim_modem_icg_init()`はWiFiビルドの`esp_wifi_init()`経路
 *  でのみ・本関数（BBPLL較正）よりずっと後に実行されるため，
 *  `hardware_init_hook()`の最初期で動くBBPLL較正には間に合わない。
 *  本関数はその最小部分集合（I2C_MASTER／MODEM_APB／LP_APB ICG
 *  ドメインのみ，WIFI/BT/FE/ZB等は対象外）を，WiFi有無に関わらず
 *  BBPLL較正の直前に独立して適用する。
 */
#define ESP32C5_R34_PMU_HP_ACTIVE_ICG_MODEM   0x600B000CU  /* icg_modem.code，bits[31:30] */
#define ESP32C5_R34_PMU_IMM_MODEM_ICG         0x600B00DCU  /* update_dig_icg_modem_en，bit31 */
#define ESP32C5_R34_PMU_IMM_SLEEP_SYSCLK      0x600B00D0U  /* update_dig_icg_switch，bit28 */
#define ESP32C5_R34_MODEM_SYSCON_CLK_CONF_POWER_ST  0x600A9C0CU  /* CLK_MODEM_APB_ST_MAP，bits[31:28] */
#define ESP32C5_R34_MODEM_LPCON_CLK_CONF_POWER_ST   0x600AF020U  /* CLK_LP_APB_ST_MAP[31:28]/CLK_I2C_MST_ST_MAP[27:24] */

static void
esp32c5_r34_modem_icg_enable_min(void)
{
	uint32_t	v;

	/*  icg_modem.code = 2（esp_shim_modem_icg_init()と同じ値）  */
	v = sil_rew_mem((void *)ESP32C5_R34_PMU_HP_ACTIVE_ICG_MODEM);
	v = (v & ~(0x3U << 30)) | (2U << 30);
	sil_wrw_mem((void *)ESP32C5_R34_PMU_HP_ACTIVE_ICG_MODEM, v);

	/*  ST_MAP（コード値2＝BIT(2)=0x4のときクロックを通す）を
	 *  MODEM_APB・LP_APB・I2C_MASTERの3ドメインへ設定  */
	v = sil_rew_mem((void *)ESP32C5_R34_MODEM_SYSCON_CLK_CONF_POWER_ST);
	v = (v & ~(0xFU << 28)) | (0x4U << 28);
	sil_wrw_mem((void *)ESP32C5_R34_MODEM_SYSCON_CLK_CONF_POWER_ST, v);

	v = sil_rew_mem((void *)ESP32C5_R34_MODEM_LPCON_CLK_CONF_POWER_ST);
	v = (v & ~(0xFU << 28)) | (0x4U << 28);			/* LP_APB_ST_MAP */
	v = (v & ~(0xFU << 24)) | (0x4U << 24);			/* I2C_MST_ST_MAP */
	sil_wrw_mem((void *)ESP32C5_R34_MODEM_LPCON_CLK_CONF_POWER_ST, v);

	/*  即時反映パルス2本（両方必要，実施13で確認済み）  */
	sil_wrw_mem((void *)ESP32C5_R34_PMU_IMM_MODEM_ICG, (1U << 31));
	sil_wrw_mem((void *)ESP32C5_R34_PMU_IMM_SLEEP_SYSCLK, (1U << 28));
}

#ifdef ESP32C5_R40_CLKREORDER
/*
 *  【実施40】候補1段階(iii)：クロック切替え順序入替（段階(i)/(ii)が
 *  ともに空振りの場合のみ）。
 *
 *  esp32c5_r34_modem_icg_enable_min()（本関数の直前）でI2C_MASTER/
 *  MODEM_APB/LP_APB ICGを最小有効化し，esp32c5_r34_bbpll_configure_
 *  480mhz()（regi2c経由のBBPLL較正）を実行する——このICG有効化は
 *  regi2cマスタ自体を動かすための前提条件であり，「BBPLL較正中も
 *  modem系クロックを全停止する」という文字どおりの実装は不可能
 *  （実施34の発見：regi2cマスタ自体がこのICGでゲートされている）。
 *
 *  そこで本段は，机上先行が示した「stockが唯一経験する構造的な違い＝
 *  CPUルートクロック切替え（PCR_SYSCLK_CONF等）の瞬間」に絞り，
 *  **BBPLL較正が完了した後・PCRのソース切替えパルスを打つ直前**で
 *  modem ICGを一旦無効化→PCR切替え→再度有効化する，という順序を試す
 *  （「切替えの瞬間だけmodem系クロックを止める」という，候補1が
 *  想定するIDF-11064型の自動ゲーティング状態を模した最小のブラケット）。
 */
static void
esp32c5_r40_modem_icg_disable_bracket(void)
{
	uint32_t	v;

	/*  icg_modem.code = 0（enable_minの2から差し戻し＝いずれのICG
	 *  ドメインもコード0はビットマップに含まれないため事実上ゲート）  */
	v = sil_rew_mem((void *)ESP32C5_R34_PMU_HP_ACTIVE_ICG_MODEM);
	v = (v & ~(0x3U << 30));
	sil_wrw_mem((void *)ESP32C5_R34_PMU_HP_ACTIVE_ICG_MODEM, v);

	v = sil_rew_mem((void *)ESP32C5_R34_MODEM_SYSCON_CLK_CONF_POWER_ST);
	v = (v & ~(0xFU << 28));
	sil_wrw_mem((void *)ESP32C5_R34_MODEM_SYSCON_CLK_CONF_POWER_ST, v);

	v = sil_rew_mem((void *)ESP32C5_R34_MODEM_LPCON_CLK_CONF_POWER_ST);
	v = (v & ~(0xFU << 28));
	v = (v & ~(0xFU << 24));
	sil_wrw_mem((void *)ESP32C5_R34_MODEM_LPCON_CLK_CONF_POWER_ST, v);

	sil_wrw_mem((void *)ESP32C5_R34_PMU_IMM_MODEM_ICG, (1U << 31));
	sil_wrw_mem((void *)ESP32C5_R34_PMU_IMM_SLEEP_SYSCLK, (1U << 28));
}
#endif /* ESP32C5_R40_CLKREORDER */

#ifdef ESP32C5_R42_APMFIX
/*
 *  【実施42・候補3の派生発見】APM (Access Permission Management) /
 *  HP-TEEブロックの因果注入：ソース監査（esp-idf-v6.1
 *  components/bootloader_support/src/bootloader_mem.c の
 *  bootloader_init_mem()）で，stockのAPPスタートアップ（
 *  `!defined(BOOTLOADER_BUILD)` ガード＝2nd-stage bootloaderではなく
 *  スタートアップ側でリンクされる）が起動ごとに必ず
 *    (1) apm_hal_enable_ctrl_filter_all(false)
 *        -- HP_APM/LP_APM0/LP_APM/CPU_APMの経路フィルタを全解除
 *    (2) apm_hal_set_master_sec_mode_all(APM_SEC_MODE_TEE)
 *        -- 全マスタ(HPCORE/LPCORE/REGDMA/SDIOSLV/MODEM/...)をTEE
 *           モードへ昇格
 *  を実行することを確認した。ASP3のDirect Bootはstockのスタートアップを
 *  一切経由しないため，これが一度も呼ばれない。
 *
 *  JTAG実測（本ラウンド，2/2冷間ブート再現・handoffと対照）：
 *    冷間：HP_APM_FUNC_CTRL_REG=0x1F（全経路フィルタ有効=ROM/POR既定）,
 *          TEE_M4_MODE_CTRL_REG（マスタ4=MODEM）=3（REE2）,
 *          HP_APM_M1_STATUS_REG=1（許可違反ラッチ），
 *          M1_EXCEPTION_INFO0=0x00130001（mode=REE2,master_id=4=MODEM,
 *          region=1），M1_EXCEPTION_INFO1=0x40806858（HP SRAM内アドレス）
 *          ＝WiFi/BTモデム・ハードウェア自身がバスマスタとしてHP SRAM
 *          （TX/RXパケットバッファ想定）へアクセスしようとしAPMに
 *          ブロックされた記録そのもの。
 *    handoff（stock経由・20AP前後で正常動作）：
 *          FUNC_CTRL_REG=0x0（全解除），TEE_M4_MODE=0（TEE），
 *          M1_STATUS=0（例外なし）。
 *  ＝CPU（HPCORE，常にTEEモードでAPMの対象外）からのMMIO
 *  read/write／regi2c較正は冷間でも全て成功するため35ラウンドの静的
 *  レジスタ診断をすり抜けていたが，MODEM自身のDMA的アクセスだけが
 *  ブロックされる，という本症状（TX無・RX無だが完走報告）と整合する。
 *
 *  本関数はbootloader_init_mem()の等価処理をASP3側で再現する（診断用・
 *  既定無効）。hardware_init_hook()末尾（実施41のBOOTHOOKと同じ位置，
 *  esp_wifi_init/PHY較正より前）から呼ぶ。
 */
#define ESP32C5_R42_TEE_MASTER_BASE     0x60098000U   /* TEE_M0..M31_MODE_CTRL_REG */
#define ESP32C5_R42_TEE_MASTER_COUNT    32U
#define ESP32C5_R42_HP_APM_FUNC_CTRL    0x600990C4U
#define ESP32C5_R42_HP_APM_M1_STATCLR   0x600990DCU
#define ESP32C5_R42_LP_APM0_FUNC_CTRL   0x600998C4U
#define ESP32C5_R42_LP_APM_FUNC_CTRL    0x600B38C4U
#define ESP32C5_R42_CPU_APM_FUNC_CTRL   0x6009A0C4U

static void
esp32c5_r42_apm_unblock(void)
{
	uint32_t	i;

	/*  (1) 4コントローラ全ての経路フィルタを解除（stockのapm_hal_
	 *  enable_ctrl_filter_all(false)相当）  */
	sil_wrw_mem((void *)ESP32C5_R42_HP_APM_FUNC_CTRL, 0U);
	sil_wrw_mem((void *)ESP32C5_R42_LP_APM0_FUNC_CTRL, 0U);
	sil_wrw_mem((void *)ESP32C5_R42_LP_APM_FUNC_CTRL, 0U);
	sil_wrw_mem((void *)ESP32C5_R42_CPU_APM_FUNC_CTRL, 0U);

