exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/target_kernel_impl.c
	/*  (2) 全マスタをTEEモード(0)へ（stockのapm_hal_set_master_sec_
	 *  mode_all(APM_SEC_MODE_TEE)相当。未実装マスタ番号への書込みは
	 *  無害と仮定——読み戻しで確認する）  */
	for (i = 0U; i < ESP32C5_R42_TEE_MASTER_COUNT; i++) {
		sil_wrw_mem((void *)(ESP32C5_R42_TEE_MASTER_BASE + i * 4U), 0U);
	}

	/*  ラッチ済み例外ステータスをクリア（本注入以降に新規の違反が
	 *  起きていないことを事後確認できるようにする）  */
	sil_wrw_mem((void *)ESP32C5_R42_HP_APM_M1_STATCLR, 1U);
}
#endif /* ESP32C5_R42_APMFIX */

static uint32_t
esp32c5_r34_regi2c_select_ctrl(void)
{
	uint32_t	conf2;
	uint32_t	i2c_sel;

	conf2 = sil_rew_mem((void *)ESP32C5_R34_I2C_ANA_MST_ANA_CONF2);
	i2c_sel = (conf2 & ESP32C5_R34_BBPLL_MST_SEL_BIT) ? 0U : 1U;
	sil_wrw_mem((void *)ESP32C5_R34_I2C_ANA_MST_ANA_CONF1,
				ESP32C5_R34_BBPLL_RD_MASK);
	return (i2c_sel == 0U) ? ESP32C5_R34_I2C_ANA_MST_I2C0_CTRL
							: ESP32C5_R34_I2C_ANA_MST_I2C1_CTRL;
}

static void
esp32c5_r34_regi2c_wait_idle(uint32_t ctrl_reg)
{
	uint32_t	i;

	for (i = 0U; i < 200000U; i++) {
		if ((sil_rew_mem((void *)ctrl_reg) & ESP32C5_R34_REGI2C_BUSY) == 0U) {
			break;
		}
	}
}

/*
 *  regi2c_impl_write()相当：block内reg_addへ1byte全体を書く
 *  （実施14手動プロトコル・`_regi2c_impl_write()`と同一の
 *  ビットレイアウト：[7:0]=slave_id(block)，[15:8]=reg_addr，
 *  [24]=WR_CNTL，[23:16]=data）。
 */
static void
esp32c5_r34_regi2c_write(uint32_t block, uint32_t reg_add, uint32_t data)
{
	uint32_t	ctrl_reg;
	uint32_t	v;

	ctrl_reg = esp32c5_r34_regi2c_select_ctrl();
	esp32c5_r34_regi2c_wait_idle(ctrl_reg);
	v = (block & 0xFFU) | ((reg_add & 0xFFU) << 8)
		| ESP32C5_R34_REGI2C_WR_CNTL | ((data & 0xFFU) << 16);
	sil_wrw_mem((void *)ctrl_reg, v);
	esp32c5_r34_regi2c_wait_idle(ctrl_reg);
}

/*
 *  regi2c_impl_write_mask()相当：block内reg_addのbits[msb:lsb]だけを
 *  read-modify-writeする。
 */
static void
esp32c5_r34_regi2c_write_mask(uint32_t block, uint32_t reg_add,
							   uint32_t msb, uint32_t lsb, uint32_t data)
{
	uint32_t	ctrl_reg;
	uint32_t	v;
	uint32_t	cur;
	uint32_t	width;
	uint32_t	mask;

	ctrl_reg = esp32c5_r34_regi2c_select_ctrl();
	esp32c5_r34_regi2c_wait_idle(ctrl_reg);
	v = (block & 0xFFU) | ((reg_add & 0xFFU) << 8);
	sil_wrw_mem((void *)ctrl_reg, v);
	esp32c5_r34_regi2c_wait_idle(ctrl_reg);
	cur = (sil_rew_mem((void *)ctrl_reg) >> 16) & 0xFFU;

	width = msb - lsb + 1U;
	mask = (width >= 8U) ? 0xFFU : ((1U << width) - 1U);
	cur &= ~(mask << lsb);
	cur |= (data & mask) << lsb;

	v = (block & 0xFFU) | ((reg_add & 0xFFU) << 8)
		| ESP32C5_R34_REGI2C_WR_CNTL | ((cur & 0xFFU) << 16);
	sil_wrw_mem((void *)ctrl_reg, v);
	esp32c5_r34_regi2c_wait_idle(ctrl_reg);
}

/*
 *  BBPLLをXTAL=48MHzプロファイルで再構成し，480MHzへ較正し直す
 *  （`rtc_clk_bbpll_configure(SOC_XTAL_FREQ_48M, CLK_LL_PLL_480M_FREQ_
 *  MHZ)`相当）。呼出し前提：CPUはまだXTAL直結（PLL未使用）——このPLLの
 *  出力はCPUクロックとして未参照のため，較正中の一時的な不定状態が
 *  CPU動作へ影響しない。
 */
static void
esp32c5_r34_bbpll_configure_480mhz(void)
{
	uint32_t	v;
	uint32_t	i;
	bool_t		done;

	/*
	 *  【実施34】I2C_MASTER/MODEM_APB/LP_APB ICGドメインの最小有効化
	 *  （esp_shim_modem_icg_init()の部分集合，上記コメント参照）。
	 *  regi2cマスタクロック前提の有効化より先に行う——ICGゲートが
	 *  閉じたままだと，直後のclk_i2c_mst_en書込み自体は「効いている
	 *  ように見える」が（MODEM_LPCON_CLK_CONFの静的configビットは常に
	 *  書換え可能），実際のANA_MST機能クロックは供給されないままで
	 *  regi2cトランザクションが無反応・無効なまま進んでしまう。
	 */
	esp32c5_r34_modem_icg_enable_min();

	/*
	 *  regi2cマスタクロック前提の有効化（ANALOG_CLOCK_ENABLE()相当，
	 *  bootloaderと同じ「一度有効化して恒久維持」戦略）。
	 *  MODEM_SYSCON_CLK_CONF.clk_i2c_mst_sel_160mは実施31の
	 *  esp32c5_r31_bootloader_random_cycle()も同じビットを立てるが，
	 *  あちらはWiFi限定・本関数より後に実行されるため，ここで独立に
	 *  先立って設定する（冪等，副作用なし）。
	 */
	v = sil_rew_mem((void *)ESP32C5_R34_MODEM_LPCON_CLK_CONF);
	sil_wrw_mem((void *)ESP32C5_R34_MODEM_LPCON_CLK_CONF,
				v | ESP32C5_R34_MODEM_LPCON_CLK_I2C_MST_EN);
	v = sil_rew_mem((void *)ESP32C5_R34_MODEM_SYSCON_CLK_CONF);
	sil_wrw_mem((void *)ESP32C5_R34_MODEM_SYSCON_CLK_CONF, v | (1U << 12));

	/*
	 *  【実施34・decision experiment】clk_i2c_mst_enをORで立てた直後に
	 *  ANA_MSTブロック（I2C_ANA_MST_ANA_CONF0等）へ即アクセスすると，
	 *  クロックドメインが実際に立ち上がる前の書込みが無視される
	 *  （実測：ANA_CONF0が恒久0x00000000のまま＝calibration_stop()の
	 *  最終書込みすら反映されない）ことをtest_porting非WiFiビルドの
	 *  JTAG読みで確認した——WiFiビルドでこれまで問題が出なかったのは，
	 *  `wifi_clock_enable_wrapper()`がこのビットを立ててから実際に
	 *  regi2cを使うまでに他の初期化処理を挟むため，結果的に十分な
	 *  settle時間が空いていたためと考えられる。ここでは`sil_*`のみに
	 *  依存する短いbusy spinでクロックドメイン立上りのcushionを設ける
	 *  （正確な時間は不明だが，数百〜数千サイクル程度あれば十分と
	 *  みて安全側に大きめの値を採る）。
	 */
	for (i = 0U; i < 10000U; i++) {
		sil_rew_mem((void *)ESP32C5_R34_MODEM_LPCON_CLK_CONF);
	}

	/*  BBPLL/BB-I2Cアナログ電源のtie-high（clk_ll_bbpll_enable()相当，
	 *  実施32から流用）。  */
	sil_wrw_mem((void *)ESP32C5_R32_PMU_IMM_HP_CK_POWER,
				ESP32C5_R32_PMU_TIE_HIGH_GLOBAL_BBPLL_ICG
				| ESP32C5_R32_PMU_TIE_HIGH_XPD_BB_I2C
				| ESP32C5_R32_PMU_TIE_HIGH_XPD_BBPLL_I2C
				| ESP32C5_R32_PMU_TIE_HIGH_XPD_BBPLL);

	/*  clk_ll_bbpll_calibration_start()：CONF0のSTOP_FORCE_HIGHを
	 *  クリア・STOP_FORCE_LOWをセット（較正回路を「実行中」へ）。  */
	v = sil_rew_mem((void *)ESP32C5_R32_I2C_ANA_MST_ANA_CONF0);
	sil_wrw_mem((void *)ESP32C5_R32_I2C_ANA_MST_ANA_CONF0, v & ~(1U << 2));
	v = sil_rew_mem((void *)ESP32C5_R32_I2C_ANA_MST_ANA_CONF0);
	sil_wrw_mem((void *)ESP32C5_R32_I2C_ANA_MST_ANA_CONF0, v | (1U << 3));

	/*  clk_ll_bbpll_set_config(480, 48)：XTAL=48MHzプロファイル
	 *  （div_ref=1,div7_0=10,dr1=1,dr3=1,dchgp=5,href=3,lref=1）を
	 *  block 0x66へ書込む。  */
	esp32c5_r34_regi2c_write(ESP32C5_R34_BBPLL_BLOCK,
							  ESP32C5_R34_BBPLL_REG_OC_REF_DIV,
							  (5U << 4) | 1U);			/* dchgp=5,div_ref=1 -> 0x51 */
	esp32c5_r34_regi2c_write(ESP32C5_R34_BBPLL_BLOCK,
							  ESP32C5_R34_BBPLL_REG_OC_DIV_7_0,
							  10U);						/* div7_0=10 (48MHzプロファイル) */
	esp32c5_r34_regi2c_write_mask(ESP32C5_R34_BBPLL_BLOCK,
								   ESP32C5_R34_BBPLL_REG_DR, 2U, 0U, 1U);	/* dr1=1 */
	esp32c5_r34_regi2c_write_mask(ESP32C5_R34_BBPLL_BLOCK,
								   ESP32C5_R34_BBPLL_REG_DR, 6U, 4U, 1U);	/* dr3=1 */
	esp32c5_r34_regi2c_write_mask(ESP32C5_R34_BBPLL_BLOCK,
								   ESP32C5_R34_BBPLL_REG_DHLREF, 7U, 6U, 1U);	/* lref=1 */
	esp32c5_r34_regi2c_write_mask(ESP32C5_R34_BBPLL_BLOCK,
								   ESP32C5_R34_BBPLL_REG_DHLREF, 5U, 4U, 3U);	/* href=3 */

	/*  while(!clk_ll_bbpll_calibration_is_done())：タイムアウト付き
	 *  （無条件whileは採用しない，安全設計方針）。  */
	done = false;
	for (i = 0U; i < 2000000U; i++) {
		v = sil_rew_mem((void *)ESP32C5_R32_I2C_ANA_MST_ANA_CONF0);
		if ((v & ESP32C5_R32_I2C_MST_BBPLL_CAL_DONE) != 0U) {
			done = true;
			break;
		}
	}
	(void)done;	/* タイムアウトしても後続のcalibration_stopは実行する
				 * （rtc_clk.cは無条件待ちだが，ASP3はここで打ち切り，
				 * 較正回路を安全な停止状態へ戻すことを優先する）。 */

