exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/target_kernel_impl.c
	/*  esp_rom_delay_us(10)相当："wait for true stop"のcushion。
	 *  ROM未リンクのB-0/B-1でも使えるよう，sil_*のみに依存する短い
	 *  busy spin（正確な10usである必要はなく，桁が合っていれば十分）
	 *  で代替する。  */
	for (i = 0U; i < 5000U; i++) {
		sil_rew_mem((void *)ESP32C5_R32_I2C_ANA_MST_ANA_CONF0);
	}

	/*  clk_ll_bbpll_calibration_stop()：STOP_FORCE_LOWをクリア・
	 *  STOP_FORCE_HIGHをセット（較正回路を確定的に停止状態へ）。  */
	v = sil_rew_mem((void *)ESP32C5_R32_I2C_ANA_MST_ANA_CONF0);
	sil_wrw_mem((void *)ESP32C5_R32_I2C_ANA_MST_ANA_CONF0, v & ~(1U << 3));
	v = sil_rew_mem((void *)ESP32C5_R32_I2C_ANA_MST_ANA_CONF0);
	sil_wrw_mem((void *)ESP32C5_R32_I2C_ANA_MST_ANA_CONF0, v | (1U << 2));
}

#ifdef ESP32C5_R36_REGI2C_SEED
/*
 *  【実施36・診断専用・既定無効】ハンドオフ(WORKS)状態で実測した
 *  regi2c系譜決定的差分8箇所へ，冷間ブートの較正実行前（点(b)）に
 *  ハンドオフ側の値をシードする因果検証実験。
 *
 *  背景：実施36の同一ソフトウェア4-way regi2cスイープ（8block×
 *  host0/1×reg0x00-0x1F，known-answer gate 4/4 PASS）で，冷間/
 *  ハンドオフ間の系譜決定的差分9語を検出した（BBPLL 3・DIG_REG 3・
 *  UNK_63 2・UNK_6b 1。ULP_CALのreg5は実施24で自己shim起因と
 *  既確定のため除外）。scan前注入（点(a)，JTAG，t=2.5s）は2/2で
 *  AP=0（因果棄却）。本関数は残る注入タイミング＝「較正前」の検証：
 *  JTAGブレークポイントによる較正前捕捉は，JTAG haltそのものが
 *  サブ秒の較正タイムラインを大きく歪めるため不可能と実測で判明
 *  したため（実施36の記録参照），ソースレベルのシードで代替する。
 *
 *  値はC5#1個体・特定時点の実測値の焼付けであり，恒久コードでは
 *  ない（実施35候補2〜4と同じ理由で既定無効・ガード付き）。
 *
 *  プロトコル（実施25 Step Aで実測確立）：ctrl_reg = host==1 ?
 *  I2C1_CTRL : I2C0_CTRL（blob自身のhost直接ルーティング），
 *  ANA_CONF1のRD_MASKはblock固有。書込み後に即読み戻し，結果を
 *  esp32c5_r36_seed_readback[]（グローバル，JTAGでnm+mdw参照可能）
 *  へ記録する。
 *
 *  呼出し位置の注意（実施36で実測学習）：本関数を`hardware_init_
 *  hook()`から呼ぶと，readback配列（.bss）がその後のカーネル起動時
 *  bssクリアで消えて書込み成立確認が不可能になる（1回目の試行で
 *  実際に発生——配列全ゼロ・マーカー消失）。タスクの点(b)定義も
 *  「較正前（hardware_init_hook後）」であるため，呼出しはアプリの
 *  main_task（esp_wifi_init直前，apps/wifi_scan/wifi_scan.c）から
 *  行う。
 */
uint32_t esp32c5_r36_seed_readback[10];

void
esp32c5_r36_regi2c_seed(void)
{
	/*  {block, host, reg, value(handoff実測), ana_conf1_mask}  */
	static const struct {
		uint8_t		block;
		uint8_t		host;
		uint8_t		reg;
		uint8_t		value;
		uint32_t	mask;
	} seeds[] = {
		{ 0x66U, 1U, 4U,  0x23U, 0x00FFFF7FU },	/* BBPLL reg4 */
		{ 0x66U, 1U, 7U,  0x0DU, 0x00FFFF7FU },	/* BBPLL reg7（点(a)でRO判明，記録目的で試行） */
		{ 0x66U, 1U, 9U,  0x03U, 0x00FFFF7FU },	/* BBPLL reg9 */
		{ 0x6DU, 0U, 5U,  0x98U, 0x00FFFBFFU },	/* DIG_REG reg5 */
		{ 0x6DU, 0U, 7U,  0x98U, 0x00FFFBFFU },	/* DIG_REG reg7 */
		{ 0x6DU, 0U, 13U, 0x42U, 0x00FFFBFFU },	/* DIG_REG reg13 */
		{ 0x63U, 1U, 3U,  0x68U, 0x00FFFFEFU },	/* UNK_63 reg3 */
		{ 0x63U, 1U, 4U,  0xC0U, 0x00FFFFEFU },	/* UNK_63 reg4 */
		{ 0x6BU, 1U, 2U,  0x54U, 0x00FFFFF7U },	/* UNK_6b reg2（txcap，実施16以来追跡） */
	};
	uint32_t	orig_conf1;
	uint32_t	ctrl_reg;
	uint32_t	v;
	uint32_t	i;

	orig_conf1 = sil_rew_mem((void *)ESP32C5_R34_I2C_ANA_MST_ANA_CONF1);
	for (i = 0U; i < (sizeof(seeds) / sizeof(seeds[0])); i++) {
		sil_wrw_mem((void *)ESP32C5_R34_I2C_ANA_MST_ANA_CONF1,
					seeds[i].mask);
		ctrl_reg = (seeds[i].host == 1U)
					? ESP32C5_R34_I2C_ANA_MST_I2C1_CTRL
					: ESP32C5_R34_I2C_ANA_MST_I2C0_CTRL;
		esp32c5_r34_regi2c_wait_idle(ctrl_reg);
		v = ((uint32_t)seeds[i].block)
			| (((uint32_t)seeds[i].reg) << 8)
			| ESP32C5_R34_REGI2C_WR_CNTL
			| (((uint32_t)seeds[i].value) << 16);
		sil_wrw_mem((void *)ctrl_reg, v);
		esp32c5_r34_regi2c_wait_idle(ctrl_reg);
		/*  読み戻し（WR_CNTL無しの素のread）  */
		v = ((uint32_t)seeds[i].block) | (((uint32_t)seeds[i].reg) << 8);
		sil_wrw_mem((void *)ctrl_reg, v);
		esp32c5_r34_regi2c_wait_idle(ctrl_reg);
		esp32c5_r36_seed_readback[i] =
			(sil_rew_mem((void *)ctrl_reg) >> 16) & 0xFFU;
	}
	sil_wrw_mem((void *)ESP32C5_R34_I2C_ANA_MST_ANA_CONF1, orig_conf1);
	esp32c5_r36_seed_readback[9] = 0xC0FFEE00U;	/* 実行済みマーカー */
}
#endif /* ESP32C5_R36_REGI2C_SEED */

/*
 *  【実施33で分離・export】全ウォッチドッグ（MWDT0/1・RTC WDT・
 *  スーパーWDT）を無効化する．
 *
 *  背景：docs/c5-bringup.md 実施33。hardware_init_hook()で起動最初期に
 *  disableしているにも関わらず，esp_wifi_scan_start()到達前後で
 *  約数秒周期のSUPER_WDT_RESET（rst:0x12）が発生し続ける現象を発見した。
 *  JTAGでLP_WDT_SWD_CONFIG_REG(0x600B1C1C)のDISABLEビット(bit30)を
 *  ハング中に繰り返し読むと終始1（無効化済みに見える）のに実機は
 *  リセットし続けるという矛盾から出発し，**真因はSWD_WPROTECT解錠キー
 *  の誤り**（`ESP32C5_LP_WDT_SWD_WKEY`が旧値0x8F1D312A——hal
 *  `lp_wdt_reg.h`のLP_WDT_SWD_WKEYフィールドの正しい値は0x50D83AA1，
 *  TIMG/RWDTと共通）と確定した。誤ったキーでは`SWD_WPROTECT`の解錠に
 *  失敗し，続く`SWD_CONFIG`へのDISABLEビット書込みが書込み保護で
 *  無視される（＝実行時は一度も真に無効化されていなかった）。DISABLE
 *  ビットがJTAG読出しで1に見えたのは，JTAG haltがWDTのカウント自体を
 *  一時停止させる副作用（r21ハーネスのSWD無効化burstと同型）により，
 *  無効化されていない実行時の挙動と、halt中の読出し値が一致しない
 *  ためだった（advisor指摘どおり）。esp32c5.hのキー定数修正により
 *  hardware_init_hook()の一度きりのdisableで完全に解消することを確認
 *  済み（本関数の追加のFEED書込みは，鍵が万一再び誤っていた場合の
 *  保険として残す．無害＝WT型自己完結）。
 */
void
esp32c5_reassert_wdt_disable(void)
{
	esp32c5_disable_mwdt(ESP32C5_TIMG0_BASE);
	esp32c5_disable_mwdt(ESP32C5_TIMG1_BASE);
	sil_wrw_mem((void *)ESP32C5_TIMG_WDTWPROTECT(ESP32C5_TIMG0_BASE),
				ESP32C5_TIMG_WDT_WKEY);
	sil_wrw_mem((void *)ESP32C5_TIMG_WDTFEED(ESP32C5_TIMG0_BASE), 1U);
	sil_wrw_mem((void *)ESP32C5_TIMG_WDTWPROTECT(ESP32C5_TIMG0_BASE), 0U);
	sil_wrw_mem((void *)ESP32C5_TIMG_WDTWPROTECT(ESP32C5_TIMG1_BASE),
				ESP32C5_TIMG_WDT_WKEY);
	sil_wrw_mem((void *)ESP32C5_TIMG_WDTFEED(ESP32C5_TIMG1_BASE), 1U);
	sil_wrw_mem((void *)ESP32C5_TIMG_WDTWPROTECT(ESP32C5_TIMG1_BASE), 0U);

	sil_wrw_mem((void *)ESP32C5_RTC_CNTL_WDTWPROTECT,
				ESP32C5_RTC_CNTL_WDT_WKEY);
	sil_wrw_mem((void *)ESP32C5_RTC_CNTL_WDTCONFIG0, 0U);
	sil_wrw_mem((void *)ESP32C5_LP_WDT_FEED, 1U);
	sil_wrw_mem((void *)ESP32C5_RTC_CNTL_WDTWPROTECT, 0U);

	sil_wrw_mem((void *)ESP32C5_RTC_CNTL_SWD_WPROTECT,
				ESP32C5_RTC_CNTL_SWD_WKEY);
	sil_orw((void *)ESP32C5_RTC_CNTL_SWD_CONF,
			ESP32C5_RTC_CNTL_SWD_AUTO_FEED_EN | (1U << 30));
	sil_orw((void *)ESP32C5_LP_WDT_SWD_CONFIG, ESP32C5_LP_WDT_SWD_FEED_BIT);
	sil_wrw_mem((void *)ESP32C5_RTC_CNTL_SWD_WPROTECT, 0U);
}

/*
 *  起動時のハードウェア初期化処理
 */
void
hardware_init_hook(void)
{
	/*
	 *  ウォッチドッグタイマの無効化
	 *  （MWDT0/1・RTC WDT・スーパーWDT．リセット後デフォルトで有効）
	 *
	 *  【実機確認待ち】docs/c5-port-design.md §8.1 6番。TIMG_WDT_WKEY
	 *  はhalヘッダのdefault値0x50D83AA1を実引用しているが（esp32c5.h
	 *  参照），LP_WDT系の解錠キーはC3/C6実績の転用（暫定値）であり，
	 *  ヘッダに正しく記載されていない可能性がある（C6のesp32c6.hに
	 *  実際に誤記があった前例あり）。実機で解錠成功（WDTリセットが
	 *  発生しないこと）を必ず確認すること。
	 */
	esp32c5_reassert_wdt_disable();

