exshonda/asp3_esp_idf/asp3/target/esp32c5_espidf/target_kernel_impl.c
	/*
	 *  CPUクロックの切替え
	 *
	 *  【実施32で確定・実装】docs/c5-bringup.md 実施32。「C6はROMが既に
	 *  適切に設定している」という旧来の仮定（下記，取り消し線的に残す）
	 *  はC5では成立しないとJTAG実測で判明した——ASP3のDirect Bootは
	 *  PCR_SYSCLK_CONF.soc_clk_sel=XTAL(0)のまま一度も切り替わらず，
	 *  実CPUクロックはXTAL48MHz直結（実測47.96〜48.00MHz，旧「192MHz
	 *  実機確定」は反証）。stockのbootloader_clock_configure()相当の
	 *  切替え（XTAL→PLL_F240M÷3，レジスタ設定はbootloader_clock_
	 *  configure(80MHz)相当）を明示的に実行する。実測CPUクロックは
	 *  96MHz（esp32c5.hのCORE_CLK_MHZコメント参照——理論値80MHzとの
	 *  不一致はBBPLL実周波数の推定違いによるとみられる，実測を正とする）。
	 *  CORE_CLK_MHZ/SIL_DLY_TIM1/TIM2もesp32c5.hで96MHz実測基準へ訂正済み。
	 *  esp_rom_set_cpu_ticks_per_us()より前に実行し，以降のus単位の
	 *  ROM遅延ループ（esp_rom_delay_us等）が正しい実クロックで動作する
	 *  ようにする。
	 *
	 *  （旧コメント，参考として残す）：C6はROMブートローダが起動時点で
	 *  既にPCRをSPLL÷3÷1＝160MHzへ設定済みと判明しソフトウェアでの
	 *  追加操作は不要だった。
	 *
	 *  esp_rom_set_cpu_ticks_per_us()（ROMの較正用大域変数
	 *  s_ticks_per_usへCORE_CLK_MHZを明示的に通知．C6はphy_init較正で
	 *  これが必要だった＝実機検証済みの根本原因修正．
	 *  docs/wifi-shim-c6.md実施48参照）は，B-0/B-1スコープ（Wi-Fi無し）
	 *  では呼び出さない：esp_rom_set_cpu_ticks_per_us自体はROM
	 *  リンカスクリプト（esp32c5.rom.api.ld＝ets_update_cpu_frequency
	 *  へのPROVIDEエイリアス）が提供するシンボルであり，B-0/B-1の
	 *  リンクにはROM ldを一切含めていないため未定義参照になる。
	 *  B-0/B-1ではesp_rom_delay_us()等ROMの較正値に依存する処理を
	 *  使わないため実害はない。
	 *
	 *  フェーズ2b（TOPPERS_ESP32C5_WIFI＝Wi-Fi統合．esp_wifi.cmakeが
	 *  ROM ld一式をリンクするためシンボルが解決可能になる）では，
	 *  phy_init等のタイミングにROM較正値が必要になるため，C6と同じ
	 *  理由でここで呼び出す。
	 *
	 *  esp32c5_r32_cpu_clock_switch()自体はsil_*w_memのみに依存し
	 *  ROMシンボルを一切参照しないため，WiFi無効ビルド（B-0/B-1，
	 *  test_porting等）でもリンク可能・実行して問題ない。むしろ
	 *  CORE_CLK_MHZ（core_syssvc.hのget_utm()等で使用）が全ビルド共通で
	 *  96MHz（実測値）を前提とするよう訂正した以上，実クロックも全ビルド
	 *  でこの設定に揃えておく方が一貫性がある。WiFi無効ビルドかどうかに関わらず
	 *  無条件で呼び出す。
	 */
	/*
	 *  【実施32・切り分け実験の結果を踏まえ本採用】advisorの指摘に従い，
	 *  クロック切替えとticks_per_us訂正を分離した対照実験を実施した：
	 *  クロック切替えを止めXTAL48MHzのまま`esp_rom_set_cpu_ticks_per_us
	 *  (48)`のみ正しく設定した場合，較正は独立2回のRTSリセット試行＋
	 *  各キャプチャ内の複数自然リブートすべてでFAIL（raw_adc恒久ゼロ）
	 *  だった（`r32_control_trial1/2.log`）——delay較正の正しさだけでは
	 *  不十分で，**PLLへのクロック切替え自体が較正キー(A)の必要条件**
	 *  であることが確定した（docs/c5-bringup.md 実施32 10節）。
	 */

	/*
	 *  【実施35】クロスカーネル・ハンドオフ実験（実施26/27/29系，本
	 *  ラウンド＝実施35で再構築）では，ホスト（stock）が既にCPU/BBPLL/
	 *  PMUクロック状態を正しく確立した後にリセット無しでこのゲストへ
	 *  制御が渡る。その状態で下記のクロック/PMU書換え系（候補1〜3＋
	 *  実施32/34のCPUクロック切替え・BBPLL再較正）を無条件実行すると，
	 *  実行中のCPUクロック源を生きたまま再切替え・BBPLLを再較正する
	 *  ことになり，ハンドオフ直後の実行中クロックにグリッチ/ハング
	 *  リスクがある（実施26のHANDOFF_SKIP_WIFI_INITと同種の配慮）。
	 *  `HANDOFF_SKIP_CLOCK_INIT`定義時はこれらをスキップし，ホストが
	 *  確立した状態をそのまま引き継ぐ。通常のDirect Boot（cold boot）
	 *  では定義しないため，実施32〜35の効果はそのまま有効。
	 */
#ifndef HANDOFF_SKIP_CLOCK_INIT
	/*
	 *  【実施35・出荷時ガード】候補2〜4はいずれも実機2/2でAP検出に
	 *  無効と確定した（causal refute，docs/c5-bringup.md実施35 3〜4・
	 *  6・9節）。候補3・4は特に，stock実測値をそのまま定数注入して
	 *  おり，`pmu_hp_system_init()`実体（`pmu_init.c:175`）を見ると
	 *  HP_MODEM/HP_SLEEPの`regulator0.dbias`はeFuse由来の基板固有電圧
	 *  トリム（`get_act_hp_dbias()`）であるべき値——HP_ACTIVE側では
	 *  PVT自動dbiasループがこの固定注入を実測でライブに上書きする
	 *  ことを確認済み（6節）だが，HP_MODEM/HP_SLEEP側で同種の上書きが
	 *  実際に起きるかは**未確認**（advisor指摘）。C5#1では実害なしと
	 *  確認済みだが，**他基板でこのコードをそのまま「出荷」すると
	 *  C5#1のトリム値を焼き付ける副作用の恐れがある**——refuteされた
	 *  実験コードを既定で無効化し，`ESP32C5_R35_ENABLE_REFUTED_
	 *  CANDIDATES`定義時のみ再現実験用に有効化できるようにする
	 *  （関数自体は次段の参考のため残置，デフォルトでは未実行）。
	 *  候補1（RTC_FAST_CLK源をRC_FASTへ）はstockの実際の選択と一致する
	 *  正しい修正でありrefuteの対象外のため，常時有効のまま残す。
	 */
#ifdef ESP32C5_R35_ENABLE_REFUTED_CANDIDATES
	/*
	 *  【実施35候補3】PMU HP_MODEMバンク（＋HP_ACTIVE.HP_REGULATOR0）の
	 *  固定値注入。stockの実行順序（`sys_rtc_init()`=`esp_rtc_init()`=
	 *  `pmu_init()`は`system_early_init()`＝esp_clk_init等より前）に
	 *  合わせ，候補1・2よりも前に置く。
	 */
	esp32c5_r35_pmu_hp_modem_bank_fixed();

	/*
	 *  【実施35候補4】PMU HP_SLEEPバンクの固定値注入。候補3と同じ
	 *  `pmu_hp_system_init()`呼出しが設定する残る1モード分。
	 */
	esp32c5_r35_pmu_hp_sleep_bank_fixed();
#endif /* ESP32C5_R35_ENABLE_REFUTED_CANDIDATES */

	/*
	 *  【実施35候補1】RTC_FAST_CLK源をRC_FASTへ切替え（esp_clk_init()の
	 *  rtc_clk_fast_src_set()相当）。stockのesp_clk_init()内での実行
	 *  順序（RTC_FAST/SLOW_CLK設定はCPU周波数切替えより前）に合わせ，
	 *  esp32c5_r32_cpu_clock_switch()の前に置く。stockの実際の選択
	 *  （RC_FAST）と一致する正しい修正のため，refuteの対象外として
	 *  常時有効。
	 */
	esp32c5_r35_rtc_fast_clk_select();

#ifdef ESP32C5_R35_ENABLE_REFUTED_CANDIDATES
	/*
	 *  【実施35候補2・因果確認段階】RTC_SLOW_CLK_CAL_REGへstock実測値を
	 *  固定注入する（esp_clk_slowclk_cal_set()相当，正式なrtc_clk_cal()
	 *  実測は未実装）。候補1（直上）は単独ではAP検出に効果がなかった
	 *  ため，候補2を追加する。診断専用の暫定注入であり，board/temp
	 *  依存の実測値をそのまま焼き付けるため既定では無効。
	 */
	esp32c5_r35_rtc_slowclk_cal_set_fixed();
#endif /* ESP32C5_R35_ENABLE_REFUTED_CANDIDATES */

	esp32c5_r32_cpu_clock_switch();
#endif /* !HANDOFF_SKIP_CLOCK_INIT */

#ifdef TOPPERS_ESP32C5_WIFI
	esp_rom_set_cpu_ticks_per_us(CORE_CLK_MHZ);

	/*
	 *  【実施31】較正キー(A)候補：stock 2nd-stageブートローダの
	 *  bootloader_random_enable/disable()（SAR ADC駆動サイクル）の
	 *  加算移植。esp_rom_set_cpu_ticks_per_us()の後（esp_rom_delay_us
	 *  のus較正が有効になった後）に置く。詳細は上のコメント・
	 *  docs/c5-bringup.md実施31参照。
	 */
	esp32c5_r31_bootloader_random_cycle();
#endif /* TOPPERS_ESP32C5_WIFI */

#ifdef ESP32C5_R41_CALL_BOOTHOOK
	/*
	 *  【実施41・変種B（外部AI Q3-3対策）】boot-hook末尾＝ブート直後
	 *  （esp_wifi_init/PHY較正より前，実施31のRNGサイクル等ASP3自身の
	 *  boot時処理は全て完了した後）で候補2（19語中14語）を注入する。
	 *  「初期化時に一度だけ読まれる」性質の語が万一あった場合の偽陰性
	 *  （esp_wifi_init直前では遅すぎる）を排除する変種。既定では未定義
	 *  （通常のCold Bootでは効果なし）。esp_wifi_init直前の変種
	 *  （ESP32C5_R41_CALL_ESPWIFIINIT，wifi_scan.c側）と排他利用を想定
	 *  （両方同時定義も害はないが二重書込みになるだけで無意味）。
	 */
	esp32c5_r41_combined_seed();
#endif /* ESP32C5_R41_CALL_BOOTHOOK */

#ifdef ESP32C5_R42_APMFIX
	/*
	 *  【実施42】APM/HP-TEEのアクセス制御をstock相当へ解除する
	 *  （因果検証の主注入。詳細は esp32c5_r42_apm_unblock() 直上の
	 *  コメント参照）。esp_wifi_init/PHY較正より前で実行する。
	 */
	esp32c5_r42_apm_unblock();
#endif /* ESP32C5_R42_APMFIX */
}

void
software_init_hook(void)
{
	/* Initialize sio for fput */
#ifdef TOPPERS_OMIT_TECS
	sio_initialize(0);
	sio_opn_por(SIOPID_FPUT, 0);
#endif
}

/*
 *  ターゲット依存部 初期化処理
 */
void
target_initialize(void)
{
	/*
	 *  チップ依存の初期化（mtvec/mtvt・CLIC・コア依存部）
	 */
	chip_initialize();

	/*
	 *  ペリフェラル割込みソースをCPU割込み線へ割り当てる
	 *  （SYSTIMER_TARGET0とFROM_CPU_0（タイマ割込みの強制用）は
	 *  同じ線に多重マップする．target_timer.h参照．FROM_CPU_1は
	 *  テストプログラム用のras_int対象＝INTNO1．target_test.h参照．
	 *  コンソール（INTNO_SIO）はUART0のソースを割り当てる。
	 *  線16〜18を使用（線1〜15はフェーズ2bのWi-Fi shim・
	 *  esp_wifi_adapter.cのset_intr_wrapperが動的に使う予定のため
	 *  予約＝C6のtarget_kernel_impl.cと同じ退避パターン）
	 */
	esp32c5_intmtx_route(ESP32C5_INTSRC_SYSTIMER_TARGET0, 16U);
	esp32c5_intmtx_route(ESP32C5_INTSRC_FROM_CPU_0, 16U);
	/*
	 *  コンソール（INTNO_SIO＝線17）はビルド時選択に応じて
	 *  USB Serial/JTAG または UART0 のソースを割り当てる
	 *  （C6の target/esp32c6_gcc/target_kernel_impl.c と同じ条件分岐．
	 *  usbjtagコンソールでUART0を割り当てるとTX完了割込みがCPUへ届かず
	 *  割込み駆動出力＝ログタスク経由のタスク出力が停止する）
	 */
#ifdef TOPPERS_ESP32C5_CONSOLE_USBJTAG
	esp32c5_intmtx_route(ESP32C5_INTSRC_USB_SERIAL_JTAG, 17U);
#else /* TOPPERS_ESP32C5_CONSOLE_USBJTAG */
	esp32c5_intmtx_route(ESP32C5_INTSRC_UART0, 17U);
#endif /* TOPPERS_ESP32C5_CONSOLE_USBJTAG */
	esp32c5_intmtx_route(ESP32C5_INTSRC_FROM_CPU_1, 18U);
}

/*
 *  ターゲット依存部 終了処理
 */
void
target_exit(void)
{
	/*
	 *  software_term_hookの呼出し
	 */
	software_term_hook();

	/* チップ依存部の終了処理 */
	chip_terminate();

#ifdef TOPPERS_USE_QEMU
	/*
	 *  セミホスティングでQEMUを終了させる（SYS_EXIT）．
	 *  RV32ではa1にADP_Stopped_ApplicationExitを直接渡す
	 *  （パラメタブロックはRV64用）．
	 */
	{
		register uint32_t a0 __asm__("a0") = 0x18;      /* SYS_EXIT */
		register uint32_t a1 __asm__("a1") = 0x20026;   /* ApplicationExit */
		__asm__ volatile(
			".balign 16\n\t"
			".option push\n\t"
			".option norvc\n\t"
			"slli zero, zero, 0x1f\n\t"
			"ebreak\n\t"
			"srai zero, zero, 7\n\t"
			".option pop"
			: : "r"(a0), "r"(a1) : "memory");
	}
#endif /* TOPPERS_USE_QEMU */

	while (1) ;
}

/*
 *  エラー発生時の処理
 */
void
Error_Handler(void)
{
	while (1) ;
}

/*
 *  デフォルトのsoftware_term_hook（weak定義）
 */
__attribute__((weak))
void software_term_hook(void)
{
}
